[
  "Artificial intelligence is the capability of computational systems to perform tasks typically associated with human intelligence, such as learning, reasoning, problemsolving, perception, and decisionmaking.",
  "It is a field of research in computer science that develops and studies methods and software that enable machines to perceive their environment and use learning and intelligence to take actions that maximize their chances of achieving defined goals.",
  "Highprofile applications of AI include advanced web search engines recommendation systems virtual assistants autonomous vehicles generative and creative tools and superhuman play and analysis in strategy games .",
  "However, many AI applications are not perceived as AI A lot of cutting edge AI has filtered into general applications, often without being called AI because once something becomes useful enough and common enough its not labeled AI anymore.",
  "Various subfields of AI research are centered around particular goals and the use of particular tools.",
  "The traditional goals of AI research include learning, reasoning, knowledge representation, planning, natural language processing, perception, and support for robotics.",
  "To reach these goals, AI researchers have adapted and integrated a wide range of techniques, including search and mathematical optimization, formal logic, artificial neural networks, and methods based on statistics, operations research, and economics.",
  "AI also draws upon psychology, linguistics, philosophy, neuroscience, and other fields.",
  "Some companies, such as OpenAI, Google DeepMind and Meta, aim to create artificial general intelligence AI that can complete virtually any cognitive task at least as well as a human.",
  "Artificial intelligence was founded as an academic discipline in 1956, and the field went through multiple cycles of optimism throughout its history, followed by periods of disappointment and loss of funding, known as AI winters.",
  "Funding and interest vastly increased after 2012 when graphics processing units started being used to accelerate neural networks and deep learning outperformed previous AI techniques.",
  "This growth accelerated further after 2017 with the transformer architecture.",
  "In the 2020s, an ongoing period of rapid progress in advanced generative AI became known as the AI boom.",
  "Generative AIs ability to create and modify content has led to several unintended consequences and harms, while raising ethical concerns about AIs longterm effects and potential existential risks, prompting discussions about regulatory policies to ensure the safety and benefits of the technology.",
  "The general problem of simulating intelligence has been broken into subproblems.",
  "These consist of particular traits or capabilities that researchers expect an intelligent system to display.",
  "The traits described below have received the most attention and cover the scope of AI research.",
  "Early researchers developed algorithms that imitated stepbystep reasoning that humans use when they solve puzzles or make logical deductions.",
  "By the late 1980s and 1990s, methods were developed for dealing with uncertain or incomplete information, employing concepts from probability and economics.",
  "Many of these algorithms are insufficient for solving large reasoning problems because they experience a combinatorial explosion They become exponentially slower as the problems grow.",
  "Even humans rarely use the stepbystep deduction that early AI research could model.",
  "They solve most of their problems using fast, intuitive judgments.",
  "Accurate and efficient reasoning is an unsolved problem.",
  "Knowledge representation and knowledge engineering allow AI programs to answer questions intelligently and make deductions about realworld facts.",
  "Formal knowledge representations are used in contentbased indexing and retrieval, scene interpretation, clinical decision support, knowledge discovery , and other areas.",
  "A knowledge base is a body of knowledge represented in a form that can be used by a program.",
  "An ontology is the set of objects, relations, concepts, and properties used by a particular domain of knowledge.",
  "Knowledge bases need to represent things such as objects, properties, categories, and relations between objects situations, events, states, and time causes and effects knowledge about knowledge default reasoning and many other aspects and domains of knowledge.",
  "Among the most difficult problems in knowledge representation are the breadth of commonsense knowledge and the subsymbolic form of most commonsense knowledge .",
  "There is also the difficulty of knowledge acquisition, the problem of obtaining knowledge for AI applications.",
  "An agent is anything that perceives and takes actions in the world.",
  "A rational agent has goals or preferences and takes actions to make them happen.",
  "In automated planning, the agent has a specific goal.",
  "In automated decisionmaking, the agent has preferencesthere are some situations it would prefer to be in, and some situations it is trying to avoid.",
  "The decisionmaking agent assigns a number to each situation that measures how much the agent prefers it.",
  "For each possible action, it can calculate the expected utility the utility of all possible outcomes of the action, weighted by the probability that the outcome will occur.",
  "It can then choose the action with the maximum expected utility.",
  "In classical planning, the agent knows exactly what the effect of any action will be.",
  "In most realworld problems, however, the agent may not be certain about the situation they are in and it may not know for certain what will happen after each possible action .",
  "It must choose an action by making a probabilistic guess and then reassess the situation to see if the action worked.",
  "In some problems, the agents preferences may be uncertain, especially if there are other agents or humans involved.",
  "These can be learned , or the agent can seek information to improve its preferences.",
  "Information value theory can be used to weigh the value of exploratory or experimental actions.",
  "The space of possible future actions and situations is typically intractably large, so the agents must take actions and evaluate situations while being uncertain of what the outcome will be.",
  "A Markov decision process has a transition model that describes the probability that a particular action will change the state in a particular way and a reward function that supplies the utility of each state and the cost of each action.",
  "A policy associates a decision with each possible state.",
  "The policy could be calculated , be heuristic, or it can be learned.",
  "Game theory describes the rational behavior of multiple interacting agents and is used in AI programs that make decisions that involve other agents.",
  "Machine learning is the study of programs that can improve their performance on a given task automatically.",
  "It has been a part of AI from the beginning.",
  "There are several kinds of machine learning.",
  "Unsupervised learning analyzes a stream of data and finds patterns and makes predictions without any other guidance.",
  "Supervised learning requires labeling the training data with the expected answers, and comes in two main varieties classification and regression .",
  "In reinforcement learning, the agent is rewarded for good responses and punished for bad ones.",
  "The agent learns to choose responses that are classified as good.",
  "Transfer learning is when the knowledge gained from one problem is applied to a new problem.",
  "Deep learning is a type of machine learning that runs inputs through biologically inspired artificial neural networks for all of these types of learning.",
  "Computational learning theory can assess learners by computational complexity, by sample complexity , or by other notions of optimization.",
  "Natural language processing allows programs to read, write and communicate in human languages.",
  "Specific problems include speech recognition, speech synthesis, machine translation, information extraction, information retrieval and question answering.",
  "Early work, based on Noam Chomskys generative grammar and semantic networks, had difficulty with wordsense disambiguation unless restricted to small domains called microworlds .",
  "Margaret Masterman believed that it was meaning and not grammar that was the key to understanding languages, and that thesauri and not dictionaries should be the basis of computational language structure.",
  "Modern deep learning techniques for NLP include word embedding , transformers , and others.",
  "In 2019, generative pretrained transformer language models began to generate coherent text, and by 2023, these models were able to get humanlevel scores on the bar exam, SAT test, GRE test, and many other realworld applications.",
  "Machine perception is the ability to use input from sensors to deduce aspects of the world.",
  "Computer vision is the ability to analyze visual input.",
  "The field includes speech recognition, image classification, facial recognition, object recognition, object tracking, and robotic perception.",
  "Affective computing is a field that comprises systems that recognize, interpret, process, or simulate human feeling, emotion, and mood.",
  "For example, some virtual assistants are programmed to speak conversationally or even to banter humorously it makes them appear more sensitive to the emotional dynamics of human interaction, or to otherwise facilitate humancomputer interaction.",
  "However, this tends to give nave users an unrealistic conception of the intelligence of existing computer agents.",
  "Moderate successes related to affective computing include textual sentiment analysis and, more recently, multimodal sentiment analysis, wherein AI classifies the effects displayed by a videotaped subject.",
  "A machine with artificial general intelligence would be able to solve a wide variety of problems with breadth and versatility similar to human intelligence.",
  "AI research uses a wide variety of techniques to accomplish the goals above.",
  "AI can solve many problems by intelligently searching through many possible solutions.",
  "There are two very different kinds of search used in AI state space search and local search.",
  "State space search State space search searches through a tree of possible states to try to find a goal state.",
  "For example, planning algorithms search through trees of goals and subgoals, attempting to find a path to a target goal, a process called meansends analysis.",
  "Simple exhaustive searches are rarely sufficient for most realworld problems the search space quickly grows to astronomical numbers.",
  "The result is a search that is too slow or never completes.",
  "Heuristics or rules of thumb can help prioritize choices that are more likely to reach a goal.",
  "Adversarial search is used for gameplaying programs, such as chess or Go.",
  "It searches through a tree of possible moves and countermoves, looking for a winning position.",
  "Local search Local search uses mathematical optimization to find a solution to a problem.",
  "It begins with some form of guess and refines it incrementally.",
  "Gradient descent is a type of local search that optimizes a set of numerical parameters by incrementally adjusting them to minimize a loss function.",
  "Variants of gradient descent are commonly used to train neural networks, through the backpropagation algorithm.",
  "Another type of local search is evolutionary computation, which aims to iteratively improve a set of candidate solutions by mutating and recombining them, selecting only the fittest to survive each generation.",
  "Distributed search processes can coordinate via swarm intelligence algorithms.",
  "Two popular swarm algorithms used in search are particle swarm optimization and ant colony optimization .",
  "Formal logic is used for reasoning and knowledge representation.",
  "Formal logic comes in two main forms propositional logic and predicate logic .",
  "Deductive reasoning in logic is the process of proving a new statement from other statements that are given and assumed to be true .",
  "Proofs can be structured as proof trees, in which nodes are labelled by sentences, and children nodes are connected to parent nodes by inference rules.",
  "Given a problem and a set of premises, problemsolving reduces to searching for a proof tree whose root node is labelled by a solution of the problem and whose leaf nodes are labelled by premises or axioms.",
  "In the case of Horn clauses, problemsolving search can be performed by reasoning forwards from the premises or backwards from the problem.",
  "In the more general case of the clausal form of firstorder logic, resolution is a single, axiomfree rule of inference, in which a problem is solved by proving a contradiction from premises that include the negation of the problem to be solved.",
  "Inference in both Horn clause logic and firstorder logic is undecidable, and therefore intractable.",
  "However, backward reasoning with Horn clauses, which underpins computation in the logic programming language Prolog, is Turing complete.",
  "Moreover, its efficiency is competitive with computation in other symbolic programming languages.",
  "Fuzzy logic assigns a degree of truth between 0 and 1.",
  "It can therefore handle propositions that are vague and partially true.",
  "Nonmonotonic logics, including logic programming with negation as failure, are designed to handle default reasoning.",
  "Other specialized versions of logic have been developed to describe many complex domains.",
  "Many problems in AI require the agent to operate with incomplete or uncertain information.",
  "AI researchers have devised a number of tools to solve these problems using methods from probability theory and economics.",
  "Precise mathematical tools have been developed that analyze how an agent can make choices and plan, using decision theory, decision analysis, and information value theory.",
  "These tools include models such as Markov decision processes, dynamic decision networks, game theory and mechanism design.",
  "Bayesian networks are a tool that can be used for reasoning , learning , planning and perception .",
  "Probabilistic algorithms can also be used for filtering, prediction, smoothing, and finding explanations for streams of data, thus helping perception systems analyze processes that occur over time .",
  "The simplest AI applications can be divided into two types classifiers , on one hand, and controllers , on the other hand.",
  "Classifiers are functions that use pattern matching to determine the closest match.",
  "They can be finetuned based on chosen examples using supervised learning.",
  "Each pattern is labeled with a certain predefined class.",
  "All the observations combined with their class labels are known as a data set.",
  "When a new observation is received, that observation is classified based on previous experience.",
  "There are many kinds of classifiers in use.",
  "The decision tree is the simplest and most widely used symbolic machine learning algorithm.",
  "Knearest neighbor algorithm was the most widely used analogical AI until the mid1990s, and Kernel methods such as the support vector machine displaced knearest neighbor in the 1990s.",
  "The naive Bayes classifier is reportedly the most widely used learner at Google, due in part to its scalability.",
  "Neural networks are also used as classifiers.",
  "An artificial neural network is based on a collection of nodes also known as artificial neurons, which loosely model the neurons in a biological brain.",
  "It is trained to recognise patterns once trained, it can recognise those patterns in fresh data.",
  "There is an input, at least one hidden layer of nodes and an output.",
  "Each node applies a function and once the weight crosses its specified threshold, the data is transmitted to the next layer.",
  "A network is typically called a deep neural network if it has at least 2 hidden layers.",
  "Learning algorithms for neural networks use local search to choose the weights that will get the right output for each input during training.",
  "The most common training technique is the backpropagation algorithm.",
  "Neural networks learn to model complex relationships between inputs and outputs and find patterns in data.",
  "In theory, a neural network can learn any function.",
  "In feedforward neural networks the signal passes in only one direction.",
  "Recurrent neural networks feed the output signal back into the input, which allows shortterm memories of previous input events.",
  "Long short term memory is the most successful architecture for recurrent neural networks.",
  "Perceptrons use only a single layer of neurons deep learning uses multiple layers.",
  "Convolutional neural networks strengthen the connection between neurons that are close to each otherthis is especially important in image processing, where a local set of neurons must identify an edge before the network can identify an object.",
  "Deep learning uses several layers of neurons between the networks inputs and outputs.",
  "The multiple layers can progressively extract higherlevel features from the raw input.",
  "For example, in image processing, lower layers may identify edges, while higher layers may identify the concepts relevant to a human such as digits, letters, or faces.",
  "Deep learning has profoundly improved the performance of programs in many important subfields of artificial intelligence, including computer vision, speech recognition, natural language processing, image classification, and others.",
  "The reason that deep learning performs so well in so many applications is not known as of 2021.",
  "The sudden success of deep learning in 20122015 did not occur because of some new discovery or theoretical breakthrough but because of two factors the incredible increase in computer power and the availability of vast amounts of training data, especially the giant curated datasets used for benchmark testing, such as ImageNet.",
  "Generative pretrained transformers are large language models that generate text based on the semantic relationships between words in sentences.",
  "Textbased GPT models are pretrained on a large corpus of text that can be from the Internet.",
  "The pretraining consists of predicting the next token .",
  "Throughout this pretraining, GPT models accumulate knowledge about the world and can then generate humanlike text by repeatedly predicting the next token.",
  "Typically, a subsequent training phase makes the model more truthful, useful, and harmless, usually with a technique called reinforcement learning from human feedback .",
  "Current GPT models are prone to generating falsehoods called hallucinations.",
  "These can be reduced with RLHF and quality data, but the problem has been getting worse for reasoning systems.",
  "Such systems are used in chatbots, which allow people to ask a question or request a task in simple text.",
  "Current models and services include ChatGPT, Claude, Gemini, Copilot, and Meta AI.",
  "Multimodal GPT models can process different types of data such as images, videos, sound, and text.",
  "In the late 2010s, graphics processing units that were increasingly designed with AIspecific enhancements and used with specialized TensorFlow software had replaced previously used central processing unit as the dominant means for largescale machine learning models training.",
  "Specialized programming languages such as Prolog were used in early AI research, but generalpurpose programming languages like Python have become predominant.",
  "The transistor density in integrated circuits has been observed to roughly double every 18 monthsa trend known as Moores law, named after the Intel cofounder Gordon Moore, who first identified it.",
  "Improvements in GPUs have been even faster, a trend sometimes called Huangs law, named after Nvidia cofounder and CEO Jensen Huang.",
  "AI and machine learning technology is used in most of the essential applications of the 2020s, including search engines , targeting online advertisements, recommendation systems , driving internet traffic, targeted advertising , virtual assistants , autonomous vehicles , automatic language translation , facial recognition and image labeling .",
  "The deployment of AI may be overseen by a chief automation officer .",
  "The application of AI in medicine and medical research has the potential to increase patient care and quality of life.",
  "Through the lens of the Hippocratic Oath, medical professionals are ethically compelled to use AI, if applications can more accurately diagnose and treat patients.",
  "For medical research, AI is an important tool for processing and integrating big data.",
  "This is particularly important for organoid and tissue engineering development which use microscopy imaging as a key technique in fabrication.",
  "It has been suggested that AI can overcome discrepancies in funding allocated to different fields of research.",
  "New AI tools can deepen the understanding of biomedically relevant pathways.",
  "For example, AlphaFold 2 demonstrated the ability to approximate, in hours rather than months, the 3D structure of a protein.",
  "In 2023, it was reported that AIguided drug discovery helped find a class of antibiotics capable of killing two different types of drugresistant bacteria.",
  "In 2024, researchers used machine learning to accelerate the search for Parkinsons disease drug treatments.",
  "Their aim was to identify compounds that block the clumping, or aggregation, of alphasynuclein .",
  "They were able to speed up the initial screening process tenfold and reduce the cost by a thousandfold.",
  "Game playing programs have been used since the 1950s to demonstrate and test AIs most advanced techniques.",
  "Deep Blue became the first computer chessplaying system to beat a reigning world chess champion, Garry Kasparov, on 11 May 1997.",
  "In 2011, in a Jeopardy!",
  "quiz show exhibition match, IBMs question answering system, Watson, defeated the two greatest Jeopardy!",
  "champions, Brad Rutter and Ken Jennings, by a significant margin.",
  "In March 2016, AlphaGo won 4 out of 5 games of Go in a match with Go champion Lee Sedol, becoming the first computer Goplaying system to beat a professional Go player without handicaps.",
  "Then, in 2017, it defeated Ke Jie, who was the best Go player in the world.",
  "Other programs handle imperfectinformation games, such as the pokerplaying program Pluribus.",
  "DeepMind developed increasingly generalistic reinforcement learning models, such as with MuZero, which could be trained to play chess, Go, or Atari games.",
  "In 2019, DeepMinds AlphaStar achieved grandmaster level in StarCraft II, a particularly challenging realtime strategy game that involves incomplete knowledge of what happens on the map.",
  "In 2021, an AI agent competed in a PlayStation Gran Turismo competition, winning against four of the worlds best Gran Turismo drivers using deep reinforcement learning.",
  "In 2024, Google DeepMind introduced SIMA, a type of AI capable of autonomously playing nine previously unseen openworld video games by observing screen output, as well as executing short, specific tasks in response to natural language instructions.",
  "Large language models, such as GPT4, Gemini, Claude, Llama or Mistral, are increasingly used in mathematics.",
  "These probabilistic models are versatile, but can also produce wrong answers in the form of hallucinations.",
  "They sometimes need a large database of mathematical problems to learn from, but also methods such as supervised finetuning or trained classifiers with humanannotated data to improve answers for new problems and learn from corrections.",
  "A February 2024 study showed that the performance of some language models for reasoning capabilities in solving math problems not included in their training data was low, even for problems with only minor deviations from trained data.",
  "One technique to improve their performance involves training the models to produce correct reasoning steps, rather than just the correct result.",
  "The Alibaba Group developed a version of its Qwen models called Qwen2Math, that achieved stateoftheart performance on several mathematical benchmarks, including 84 accuracy on the MATH dataset of competition mathematics problems.",
  "In January 2025, Microsoft proposed the technique rStarMath that leverages Monte Carlo tree search and stepbystep reasoning, enabling a relatively small language model like Qwen7B to solve 53 of the AIME 2024 and 90 of the MATH benchmark problems.",
  "Alternatively, dedicated models for mathematical problem solving with higher precision for the outcome including proof of theorems have been developed such as AlphaTensor, AlphaGeometry, AlphaProof and AlphaEvolve all from Google DeepMind, Llemma from EleutherAI or Julius.",
  "When natural language is used to describe mathematical problems, converters can transform such prompts into a formal language such as Lean to define mathematical tasks.",
  "Some models have been developed to solve challenging problems and reach good results in benchmark tests, others to serve as educational tools in mathematics.",
  "Topological deep learning integrates various topological approaches.",
  "Finance is one of the fastest growing sectors where applied AI tools are being deployed from retail online banking to investment advice and insurance, where automated robot advisers have been in use for some years.",
  "According to Nicolas Firzli, director of the World Pensions Investments Forum, it may be too early to see the emergence of highly innovative AIinformed financial products and services.",
  "He argues that the deployment of AI tools will simply further automatise things destroying tens of thousands of jobs in banking, financial planning, and pension advice in the process, but Im not sure it will unleash a new wave of pension innovation.",
  "Various countries are deploying AI military applications.",
  "The main applications enhance command and control, communications, sensors, integration and interoperability.",
  "Research is targeting intelligence collection and analysis, logistics, cyber operations, information operations, and semiautonomous and autonomous vehicles.",
  "AI technologies enable coordination of sensors and effectors, threat detection and identification, marking of enemy positions, target acquisition, coordination and deconfliction of distributed Joint Fires between networked combat vehicles, both humanoperated and autonomous.",
  "AI has been used in military operations in Iraq, Syria, Israel and Ukraine.",
  "AI agents are software entities designed to perceive their environment, make decisions, and take actions autonomously to achieve specific goals.",
  "These agents can interact with users, their environment, or other agents.",
  "AI agents are used in various applications, including virtual assistants, chatbots, autonomous vehicles, gameplaying systems, and industrial robotics.",
  "AI agents operate within the constraints of their programming, available computational resources, and hardware limitations.",
  "This means they are restricted to performing tasks within their defined scope and have finite memory and processing capabilities.",
  "In realworld applications, AI agents often face time constraints for decisionmaking and action execution.",
  "Many AI agents incorporate learning algorithms, enabling them to improve their performance over time through experience or training.",
  "Using machine learning, AI agents can adapt to new situations and optimise their behaviour for their designated tasks.",
  "Applications of AI in this domain include AIenabled menstruation and fertility trackers that analyze user data to offer predictions, AIintegrated sex toys , AIgenerated sexual education content, and AI agents that simulate sexual and romantic partners .",
  "AI is also used for the production of nonconsensual deepfake pornography, raising significant ethical and legal concerns.",
  "AI technologies have also been used to attempt to identify online genderbased violence and online sexual grooming of minors.",
  "There are also thousands of successful AI applications used to solve specific problems for specific industries or institutions.",
  "In a 2017 survey, one in five companies reported having incorporated AI in some offerings or processes.",
  "A few examples are energy storage, medical diagnosis, military logistics, applications that predict the result of judicial decisions, foreign policy, or supply chain management.",
  "AI applications for evacuation and disaster management are growing.",
  "AI has been used to investigate patterns in largescale and smallscale evacuations using historical data from GPS, videos or social media.",
  "Furthermore, AI can provide realtime information on the evacuation conditions.",
  "In agriculture, AI has helped farmers to increase yield and identify areas that need irrigation, fertilization, pesticide treatments.",
  "Agronomists use AI to conduct research and development.",
  "AI has been used to predict the ripening time for crops such as tomatoes, monitor soil moisture, operate agricultural robots, conduct predictive analytics, classify livestock pig call emotions, automate greenhouses, detect diseases and pests, and save water.",
  "Artificial intelligence is used in astronomy to analyze increasing amounts of available data and applications, mainly for classification, regression, clustering, forecasting, generation, discovery, and the development of new scientific insights.",
  "For example, it is used for discovering exoplanets, forecasting solar activity, and distinguishing between signals and instrumental effects in gravitational wave astronomy.",
  "Additionally, it could be used for activities in space, such as space exploration, including the analysis of data from space missions, realtime science decisions of spacecraft, space debris avoidance, and more autonomous operation.",
  "During the 2024 Indian elections, US50 million was spent on authorized AIgenerated content, notably by creating deepfakes of allied politicians to better engage with voters, and by translating speeches to various local languages.",
  "AI has potential benefits and potential risks.",
  "AI may be able to advance science and find solutions for serious problems Demis Hassabis of DeepMind hopes to solve intelligence, and then use that to solve everything else.",
  "However, as the use of AI has become widespread, several unintended consequences and risks have been identified.",
  "Inproduction systems can sometimes not factor ethics and bias into their AI training processes, especially when the AI algorithms are inherently unexplainable in deep learning.",
  "Privacy and copyright Machine learning algorithms require large amounts of data.",
  "The techniques used to acquire this data have raised concerns about privacy, surveillance and copyright.",
  "AIpowered devices and services, such as virtual assistants and IoT products, continuously collect personal information, raising concerns about intrusive data gathering and unauthorized access by third parties.",
  "The loss of privacy is further exacerbated by AIs ability to process and combine vast amounts of data, potentially leading to a surveillance society where individual activities are constantly monitored and analyzed without adequate safeguards or transparency.",
  "Sensitive user data collected may include online activity records, geolocation data, video, or audio.",
  "For example, in order to build speech recognition algorithms, Amazon has recorded millions of private conversations and allowed temporary workers to listen to and transcribe some of them.",
  "Opinions about this widespread surveillance range from those who see it as a necessary evil to those for whom it is clearly unethical and a violation of the right to privacy.",
  "AI developers argue that this is the only way to deliver valuable applications and have developed several techniques that attempt to preserve privacy while still obtaining the data, such as data aggregation, deidentification and differential privacy.",
  "Since 2016, some privacy experts, such as Cynthia Dwork, have begun to view privacy in terms of fairness.",
  "Brian Christian wrote that experts have pivoted from the question of what they know to the question of what theyre doing with it.",
  "Generative AI is often trained on unlicensed copyrighted works, including in domains such as images or computer code the output is then used under the rationale of fair use.",
  "Experts disagree about how well and under what circumstances this rationale will hold up in courts of law relevant factors may include the purpose and character of the use of the copyrighted work and the effect upon the potential market for the copyrighted work.",
  "Website owners who do not wish to have their content scraped can indicate it in a robots.",
  "In 2023, leading authors sued AI companies for using their work to train generative AI.",
  "Another discussed approach is to envision a separate sui generis system of protection for creations generated by AI to ensure fair attribution and compensation for human authors.",
  "Dominance by tech giants The commercial AI scene is dominated by Big Tech companies such as Alphabet Inc.",
  ", Meta Platforms, and Microsoft.",
  "Some of these players already own the vast majority of existing cloud infrastructure and computing power from data centers, allowing them to entrench further in the marketplace.",
  "Power needs and environmental impacts In January 2024, the International Energy Agency released Electricity 2024, Analysis and Forecast to 2026, forecasting electric power use.",
  "This is the first IEA report to make projections for data centers and power consumption for artificial intelligence and cryptocurrency.",
  "The report states that power demand for these uses might double by 2026, with additional electric power usage equal to electricity used by the whole Japanese nation.",
  "Prodigious power consumption by AI is responsible for the growth of fossil fuel use, and might delay closings of obsolete, carbonemitting coal energy facilities.",
  "There is a feverish rise in the construction of data centers throughout the US, making large technology firms into voracious consumers of electric power.",
  "Projected electric consumption is so immense that there is concern that it will be fulfilled no matter the source.",
  "A ChatGPT search involves the use of 10 times the electrical energy as a Google search.",
  "The large firms are in haste to find power sources from nuclear energy to geothermal to fusion.",
  "The tech firms argue that in the long view AI will be eventually kinder to the environment, but they need the energy now.",
  "AI makes the power grid more efficient and intelligent, will assist in the growth of nuclear power, and track overall carbon emissions, according to technology firms.",
  "A 2024 Goldman Sachs Research Paper, AI Data Centers and the Coming US Power Demand Surge, found US power demand likely to experience growth not seen in a generation....",
  "and forecasts that, by 2030, US data centers will consume 8 of US power, as opposed to 3 in 2022, presaging growth for the electrical power generation industry by a variety of means.",
  "Data centers need for more and more electrical power is such that they might max out the electrical grid.",
  "The Big Tech companies counter that AI can be used to maximize the utilization of the grid by all.",
  "In 2024, the Wall Street Journal reported that big AI companies have begun negotiations with the US nuclear power providers to provide electricity to the data centers.",
  "In March 2024 Amazon purchased a Pennsylvania nuclearpowered data center for US650 million.",
  "Nvidia CEO Jensen Huang said nuclear power is a good option for the data centers.",
  "In September 2024, Microsoft announced an agreement with Constellation Energy to reopen the Three Mile Island nuclear power plant to provide Microsoft with 100 of all electric power produced by the plant for 20 years.",
  "Reopening the plant, which suffered a partial nuclear meltdown of its Unit 2 reactor in 1979, will require Constellation to get through strict regulatory processes which will include extensive safety scrutiny from the US Nuclear Regulatory Commission.",
  "If approved , over 835 megawatts of power enough for 800,000 homes of energy will be produced.",
  "The cost for reopening and upgrading is estimated at US1.",
  "6 billion and is dependent on tax breaks for nuclear power contained in the 2022 US Inflation Reduction Act.",
  "The US government and the state of Michigan are investing almost US2 billion to reopen the Palisades Nuclear reactor on Lake Michigan.",
  "Closed since 2022, the plant is planned to be reopened in October 2025.",
  "The Three Mile Island facility will be renamed the Crane Clean Energy Center after Chris Crane, a nuclear proponent and former CEO of Exelon who was responsible for Exelons spinoff of Constellation.",
  "After the last approval in September 2023, Taiwan suspended the approval of data centers north of Taoyuan with a capacity of more than 5 MW in 2024, due to power supply shortages.",
  "Taiwan aims to phase out nuclear power by 2025.",
  "On the other hand, Singapore imposed a ban on the opening of data centers in 2019 due to electric power, but in 2022, lifted this ban.",
  "Although most nuclear plants in Japan have been shut down after the 2011 Fukushima nuclear accident, according to an October 2024 Bloomberg article in Japanese, cloud gaming services company Ubitus, in which Nvidia has a stake, is looking for land in Japan near nuclear power plant for a new data center for generative AI.",
  "Ubitus CEO Wesley Kuo said nuclear power plants are the most efficient, cheap and stable power for AI.",
  "On 1 November 2024, the Federal Energy Regulatory Commission rejected an application submitted by Talen Energy for approval to supply some electricity from the nuclear power station Susquehanna to Amazons data center.",
  "According to the Commission Chairman Willie L.",
  "Phillips, it is a burden on the electricity grid as well as a significant cost shifting concern to households and other business sectors.",
  "In 2025, a report prepared by the International Energy Agency estimated the greenhouse gas emissions from the energy consumption of AI at 180 million tons.",
  "By 2035, these emissions could rise to 300500 million tonnes depending on what measures will be taken.",
  "This is below 1.5 of the energy sector emissions.",
  "The emissions reduction potential of AI was estimated at 5 of the energy sector emissions, but rebound effects can reduce it.",
  "Misinformation YouTube, Facebook and others use recommender systems to guide users to more content.",
  "These AI programs were given the goal of maximizing user engagement .",
  "The AI learned that users tended to choose misinformation, conspiracy theories, and extreme partisan content, and, to keep them watching, the AI recommended more of it.",
  "Users also tended to watch more content on the same subject, so the AI led people into filter bubbles where they received multiple versions of the same misinformation.",
  "This convinced many users that the misinformation was true, and ultimately undermined trust in institutions, the media and the government.",
  "The AI program had correctly learned to maximize its goal, but the result was harmful to society.",
  "election in 2016, major technology companies took some steps to mitigate the problem.",
  "In the early 2020s, generative AI began to create images, audio, and texts that are virtually indistinguishable from real photographs, recordings, or human writing, while realistic AIgenerated videos became feasible in the mid2020s.",
  "It is possible for bad actors to use this technology to create massive amounts of misinformation or propaganda one such potential malicious use is deepfakes for computational propaganda.",
  "AI pioneer Geoffrey Hinton expressed concern about AI enabling authoritarian leaders to manipulate their electorates on a large scale, among other risks.",
  "AI researchers at Microsoft, OpenAI, universities and other organisations have suggested using personhood credentials as a way to overcome online deception enabled by AI models.",
  "Algorithmic bias and fairness Machine learning applications will be biased if they learn from biased data.",
  "The developers may not be aware that the bias exists.",
  "Bias can be introduced by the way training data is selected and by the way a model is deployed.",
  "If a biased algorithm is used to make decisions that can seriously harm people then the algorithm may cause discrimination.",
  "The field of fairness studies how to prevent harms from algorithmic biases.",
  "On June 28, 2015, Google Photoss new image labeling feature mistakenly identified Jacky Alcine and a friend as gorillas because they were black.",
  "The system was trained on a dataset that contained very few images of black people, a problem called sample size disparity.",
  "Google fixed this problem by preventing the system from labelling anything as a gorilla.",
  "Eight years later, in 2023, Google Photos still could not identify a gorilla, and neither could similar products from Apple, Facebook, Microsoft and Amazon.",
  "COMPAS is a commercial program widely used by U.",
  "courts to assess the likelihood of a defendant becoming a recidivist.",
  "In 2016, Julia Angwin at ProPublica discovered that COMPAS exhibited racial bias, despite the fact that the program was not told the races of the defendants.",
  "Although the error rate for both whites and blacks was calibrated equal at exactly 61, the errors for each race were differentthe system consistently overestimated the chance that a black person would reoffend and would underestimate the chance that a white person would not reoffend.",
  "In 2017, several researchers showed that it was mathematically impossible for COMPAS to accommodate all possible measures of fairness when the base rates of reoffense were different for whites and blacks in the data.",
  "A program can make biased decisions even if the data does not explicitly mention a problematic feature .",
  "The feature will correlate with other features , and the program will make the same decisions based on these features as it would on race or gender.",
  "Moritz Hardt said the most robust fact in this research area is that fairness through blindness doesnt work.",
  "Criticism of COMPAS highlighted that machine learning models are designed to make predictions that are only valid if we assume that the future will resemble the past.",
  "If they are trained on data that includes the results of racist decisions in the past, machine learning models must predict that racist decisions will be made in the future.",
  "If an application then uses these predictions as recommendations, some of these recommendations will likely be racist.",
  "Thus, machine learning is not well suited to help make decisions in areas where there is hope that the future will be better than the past.",
  "It is descriptive rather than prescriptive.",
  "Bias and unfairness may go undetected because the developers are overwhelmingly white and male among AI engineers, about 4 are black and 20 are women.",
  "There are various conflicting definitions and mathematical models of fairness.",
  "These notions depend on ethical assumptions, and are influenced by beliefs about society.",
  "One broad category is distributive fairness, which focuses on the outcomes, often identifying groups and seeking to compensate for statistical disparities.",
  "Representational fairness tries to ensure that AI systems do not reinforce negative stereotypes or render certain groups invisible.",
  "Procedural fairness focuses on the decision process rather than the outcome.",
  "The most relevant notions of fairness may depend on the context, notably the type of AI application and the stakeholders.",
  "The subjectivity in the notions of bias and fairness makes it difficult for companies to operationalize them.",
  "Having access to sensitive attributes such as race or gender is also considered by many AI ethicists to be necessary in order to compensate for biases, but it may conflict with antidiscrimination laws.",
  "At its 2022 Conference on Fairness, Accountability, and Transparency , the Association for Computing Machinery, in Seoul, South Korea, presented and published findings that recommend that until AI and robotics systems are demonstrated to be free of bias mistakes, they are unsafe, and the use of selflearning neural networks trained on vast, unregulated sources of flawed internet data should be curtailed.",
  "Lack of transparency Many AI systems are so complex that their designers cannot explain how they reach their decisions.",
  "Particularly with deep neural networks, in which there are many nonlinear relationships between inputs and outputs.",
  "But some popular explainability techniques exist.",
  "It is impossible to be certain that a program is operating correctly if no one knows how exactly it works.",
  "There have been many cases where a machine learning program passed rigorous tests, but nevertheless learned something different than what the programmers intended.",
  "For example, a system that could identify skin diseases better than medical professionals was found to actually have a strong tendency to classify images with a ruler as cancerous, because pictures of malignancies typically include a ruler to show the scale.",
  "Another machine learning system designed to help effectively allocate medical resources was found to classify patients with asthma as being at low risk of dying from pneumonia.",
  "Having asthma is actually a severe risk factor, but since the patients having asthma would usually get much more medical care, they were relatively unlikely to die according to the training data.",
  "The correlation between asthma and low risk of dying from pneumonia was real, but misleading.",
  "People who have been harmed by an algorithms decision have a right to an explanation.",
  "Doctors, for example, are expected to clearly and completely explain to their colleagues the reasoning behind any decision they make.",
  "Early drafts of the European Unions General Data Protection Regulation in 2016 included an explicit statement that this right exists.",
  "Industry experts noted that this is an unsolved problem with no solution in sight.",
  "Regulators argued that nevertheless the harm is real if the problem has no solution, the tools should not be used.",
  "DARPA established the XAI program in 2014 to try to solve these problems.",
  "Several approaches aim to address the transparency problem.",
  "SHAP enables to visualise the contribution of each feature to the output.",
  "LIME can locally approximate a models outputs with a simpler, interpretable model.",
  "Multitask learning provides a large number of outputs in addition to the target classification.",
  "These other outputs can help developers deduce what the network has learned.",
  "Deconvolution, DeepDream and other generative methods can allow developers to see what different layers of a deep network for computer vision have learned, and produce output that can suggest what the network is learning.",
  "For generative pretrained transformers, Anthropic developed a technique based on dictionary learning that associates patterns of neuron activations with humanunderstandable concepts.",
  "Bad actors and weaponized AI Artificial intelligence provides a number of tools that are useful to bad actors, such as authoritarian governments, terrorists, criminals or rogue states.",
  "A lethal autonomous weapon is a machine that locates, selects and engages human targets without human supervision.",
  "Widely available AI tools can be used by bad actors to develop inexpensive autonomous weapons and, if produced at scale, they are potentially weapons of mass destruction.",
  "Even when used in conventional warfare, they currently cannot reliably choose targets and could potentially kill an innocent person.",
  "In 2014, 30 nations supported a ban on autonomous weapons under the United Nations Convention on Certain Conventional Weapons, however the United States and others disagreed.",
  "By 2015, over fifty countries were reported to be researching battlefield robots.",
  "AI tools make it easier for authoritarian governments to efficiently control their citizens in several ways.",
  "Face and voice recognition allow widespread surveillance.",
  "Machine learning, operating this data, can classify potential enemies of the state and prevent them from hiding.",
  "Recommendation systems can precisely target propaganda and misinformation for maximum effect.",
  "Deepfakes and generative AI aid in producing misinformation.",
  "Advanced AI can make authoritarian centralized decisionmaking more competitive than liberal and decentralized systems such as markets.",
  "It lowers the cost and difficulty of digital warfare and advanced spyware.",
  "All these technologies have been available since 2020 or earlierAI facial recognition systems are already being used for mass surveillance in China.",
  "There are many other ways in which AI is expected to help bad actors, some of which can not be foreseen.",
  "For example, machinelearning AI is able to design tens of thousands of toxic molecules in a matter of hours.",
  "Technological unemployment Economists have frequently highlighted the risks of redundancies from AI, and speculated about unemployment if there is no adequate social policy for full employment.",
  "In the past, technology has tended to increase rather than reduce total employment, but economists acknowledge that were in uncharted territory with AI.",
  "A survey of economists showed disagreement about whether the increasing use of robots and AI will cause a substantial increase in longterm unemployment, but they generally agree that it could be a net benefit if productivity gains are redistributed.",
  "Risk estimates vary for example, in the 2010s, Michael Osborne and Carl Benedikt Frey estimated 47 of U.",
  "jobs are at high risk of potential automation, while an OECD report classified only 9 of U.",
  "The methodology of speculating about future employment levels has been criticised as lacking evidential foundation, and for implying that technology, rather than social policy, creates unemployment, as opposed to redundancies.",
  "In April 2023, it was reported that 70 of the jobs for Chinese video game illustrators had been eliminated by generative artificial intelligence.",
  "Unlike previous waves of automation, many middleclass jobs may be eliminated by artificial intelligence The Economist stated in 2015 that the worry that AI could do to whitecollar jobs what steam power did to bluecollar ones during the Industrial Revolution is worth taking seriously.",
  "Jobs at extreme risk range from paralegals to fast food cooks, while job demand is likely to increase for carerelated professions ranging from personal healthcare to the clergy.",
  "From the early days of the development of artificial intelligence, there have been arguments, for example, those put forward by Joseph Weizenbaum, about whether tasks that can be done by computers actually should be done by them, given the difference between computers and humans, and between quantitative calculation and qualitative, valuebased judgement.",
  "Existential risk It has been argued AI will become so powerful that humanity may irreversibly lose control of it.",
  "This could, as physicist Stephen Hawking stated, spell the end of the human race.",
  "This scenario has been common in science fiction, when a computer or robot suddenly develops a humanlike selfawareness and becomes a malevolent character.",
  "These scifi scenarios are misleading in several ways.",
  "First, AI does not require humanlike sentience to be an existential risk.",
  "Modern AI programs are given specific goals and use learning and intelligence to achieve them.",
  "Philosopher Nick Bostrom argued that if one gives almost any goal to a sufficiently powerful AI, it may choose to destroy humanity to achieve it .",
  "Stuart Russell gives the example of household robot that tries to find a way to kill its owner to prevent it from being unplugged, reasoning that you cant fetch the coffee if youre dead.",
  "In order to be safe for humanity, a superintelligence would have to be genuinely aligned with humanitys morality and values so that it is fundamentally on our side.",
  "Second, Yuval Noah Harari argues that AI does not require a robot body or physical control to pose an existential risk.",
  "The essential parts of civilization are not physical.",
  "Things like ideologies, law, government, money and the economy are built on language they exist because there are stories that billions of people believe.",
  "The current prevalence of misinformation suggests that an AI could use language to convince people to believe anything, even to take actions that are destructive.",
  "The opinions amongst experts and industry insiders are mixed, with sizable fractions both concerned and unconcerned by risk from eventual superintelligent AI.",
  "Personalities such as Stephen Hawking, Bill Gates, and Elon Musk, as well as AI pioneers such as Yoshua Bengio, Stuart Russell, Demis Hassabis, and Sam Altman, have expressed concerns about existential risk from AI.",
  "In May 2023, Geoffrey Hinton announced his resignation from Google in order to be able to freely speak out about the risks of AI without considering how this impacts Google.",
  "He notably mentioned risks of an AI takeover, and stressed that in order to avoid the worst outcomes, establishing safety guidelines will require cooperation among those competing in use of AI.",
  "In 2023, many leading AI experts endorsed the joint statement that Mitigating the risk of extinction from AI should be a global priority alongside other societalscale risks such as pandemics and nuclear war.",
  "Some other researchers were more optimistic.",
  "AI pioneer Jrgen Schmidhuber did not sign the joint statement, emphasising that in 95 of all cases, AI research is about making human lives longer and healthier and easier.",
  "While the tools that are now being used to improve lives can also be used by bad actors, they can also be used against the bad actors.",
  "Andrew Ng also argued that its a mistake to fall for the doomsday hype on AIand that regulators who do will only benefit vested interests.",
  "Yann LeCun scoffs at his peers dystopian scenarios of supercharged misinformation and even, eventually, human extinction.",
  "In the early 2010s, experts argued that the risks are too distant in the future to warrant research or that humans will be valuable from the perspective of a superintelligent machine.",
  "However, after 2016, the study of current and future risks and possible solutions became a serious area of research.",
  "Friendly AI are machines that have been designed from the beginning to minimize risks and to make choices that benefit humans.",
  "Eliezer Yudkowsky, who coined the term, argues that developing friendly AI should be a higher research priority it may require a large investment and it must be completed before AI becomes an existential risk.",
  "Machines with intelligence have the potential to use their intelligence to make ethical decisions.",
  "The field of machine ethics provides machines with ethical principles and procedures for resolving ethical dilemmas.",
  "The field of machine ethics is also called computational morality, and was founded at an AAAI symposium in 2005.",
  "Other approaches include Wendell Wallachs artificial moral agents and Stuart J.",
  "Russells three principles for developing provably beneficial machines.",
  "Active organizations in the AI opensource community include Hugging Face, Google, EleutherAI and Meta.",
  "Various AI models, such as Llama 2, Mistral or Stable Diffusion, have been made openweight, meaning that their architecture and trained parameters are publicly available.",
  "Openweight models can be freely finetuned, which allows companies to specialize them with their own data and for their own usecase.",
  "Openweight models are useful for research and innovation but can also be misused.",
  "Since they can be finetuned, any builtin security measure, such as objecting to harmful requests, can be trained away until it becomes ineffective.",
  "Some researchers warn that future AI models may develop dangerous capabilities and that once released on the Internet, they cannot be deleted everywhere if needed.",
  "They recommend prerelease audits and costbenefit analyses.",
  "Artificial intelligence projects can be guided by ethical considerations during the design, development, and implementation of an AI system.",
  "An AI framework such as the Care and Act Framework, developed by the Alan Turing Institute and based on the SUM values, outlines four main ethical dimensions, defined as follows Respect the dignity of individual people Connect with other people sincerely, openly, and inclusively Care for the wellbeing of everyone Protect social values, justice, and the public interest Other developments in ethical frameworks include those decided upon during the Asilomar Conference, the Montreal Declaration for Responsible AI, and the IEEEs Ethics of Autonomous Systems initiative, among others however, these principles are not without criticism, especially regarding the people chosen to contribute to these frameworks.",
  "Promotion of the wellbeing of the people and communities that these technologies affect requires consideration of the social and ethical implications at all stages of AI system design, development and implementation, and collaboration between job roles such as data scientists, product managers, data engineers, domain experts, and delivery managers.",
  "The UK AI Safety Institute released in 2024 a testing toolset called Inspect for AI safety evaluations available under an MIT opensource licence which is freely available on GitHub and can be improved with thirdparty packages.",
  "It can be used to evaluate AI models in a range of areas including core knowledge, ability to reason, and autonomous capabilities.",
  "The regulation of artificial intelligence is the development of public sector policies and laws for promoting and regulating AI it is therefore related to the broader regulation of algorithms.",
  "The regulatory and policy landscape for AI is an emerging issue in jurisdictions globally.",
  "According to AI Index at Stanford, the annual number of AIrelated laws passed in the 127 survey countries jumped from one passed in 2016 to 37 passed in 2022 alone.",
  "Between 2016 and 2020, more than 30 countries adopted dedicated strategies for AI.",
  "Most EU member states had released national AI strategies, as had Canada, China, India, Japan, Mauritius, the Russian Federation, Saudi Arabia, United Arab Emirates, U.",
  "Others were in the process of elaborating their own AI strategy, including Bangladesh, Malaysia and Tunisia.",
  "The Global Partnership on Artificial Intelligence was launched in June 2020, stating a need for AI to be developed in accordance with human rights and democratic values, to ensure public confidence and trust in the technology.",
  "Henry Kissinger, Eric Schmidt, and Daniel Huttenlocher published a joint statement in November 2021 calling for a government commission to regulate AI.",
  "In 2023, OpenAI leaders published recommendations for the governance of superintelligence, which they believe may happen in less than 10 years.",
  "In 2023, the United Nations also launched an advisory body to provide recommendations on AI governance the body comprises technology company executives, government officials and academics.",
  "In 2024, the Council of Europe created the first international legally binding treaty on AI, called the Framework Convention on Artificial Intelligence and Human Rights, Democracy and the Rule of Law.",
  "It was adopted by the European Union, the United States, the United Kingdom, and other signatories.",
  "In a 2022 Ipsos survey, attitudes towards AI varied greatly by country 78 of Chinese citizens, but only 35 of Americans, agreed that products and services using AI have more benefits than drawbacks.",
  "A 2023 ReutersIpsos poll found that 61 of Americans agree, and 22 disagree, that AI poses risks to humanity.",
  "In a 2023 Fox News poll, 35 of Americans thought it very important, and an additional 41 thought it somewhat important, for the federal government to regulate AI, versus 13 responding not very important and 8 responding not at all important.",
  "In November 2023, the first global AI Safety Summit was held in Bletchley Park in the UK to discuss the near and far term risks of AI and the possibility of mandatory and voluntary regulatory frameworks.",
  "28 countries including the United States, China, and the European Union issued a declaration at the start of the summit, calling for international cooperation to manage the challenges and risks of artificial intelligence.",
  "In May 2024 at the AI Seoul Summit, 16 global AI tech companies agreed to safety commitments on the development of AI.",
  "The study of mechanical or formal reasoning began with philosophers and mathematicians in antiquity.",
  "The study of logic led directly to Alan Turings theory of computation, which suggested that a machine, by shuffling symbols as simple as 0 and 1, could simulate any conceivable form of mathematical reasoning.",
  "This, along with concurrent discoveries in cybernetics, information theory and neurobiology, led researchers to consider the possibility of building an electronic brain.",
  "They developed several areas of research that would become part of AI, such as McCulloch and Pitts design for artificial neurons in 1943, and Turings influential 1950 paper Computing Machinery and Intelligence, which introduced the Turing test and showed that machine intelligence was plausible.",
  "The field of AI research was founded at a workshop at Dartmouth College in 1956.",
  "The attendees became the leaders of AI research in the 1960s.",
  "They and their students produced programs that the press described as astonishing computers were learning checkers strategies, solving word problems in algebra, proving logical theorems and speaking English.",
  "Artificial intelligence laboratories were set up at a number of British and U.",
  "universities in the latter 1950s and early 1960s.",
  "Researchers in the 1960s and the 1970s were convinced that their methods would eventually succeed in creating a machine with general intelligence and considered this the goal of their field.",
  "In 1965 Herbert Simon predicted, machines will be capable, within twenty years, of doing any work a man can do.",
  "In 1967 Marvin Minsky agreed, writing that within a generation ...",
  "the problem of creating artificial intelligence will substantially be solved.",
  "They had, however, underestimated the difficulty of the problem.",
  "and British governments cut off exploratory research in response to the criticism of Sir James Lighthill and ongoing pressure from the U.",
  "Congress to fund more productive projects.",
  "Minsky and Paperts book Perceptrons was understood as proving that artificial neural networks would never be useful for solving realworld tasks, thus discrediting the approach altogether.",
  "The AI winter, a period when obtaining funding for AI projects was difficult, followed.",
  "In the early 1980s, AI research was revived by the commercial success of expert systems, a form of AI program that simulated the knowledge and analytical skills of human experts.",
  "By 1985, the market for AI had reached over a billion dollars.",
  "At the same time, Japans fifth generation computer project inspired the U.",
  "and British governments to restore funding for academic research.",
  "However, beginning with the collapse of the Lisp Machine market in 1987, AI once again fell into disrepute, and a second, longerlasting winter began.",
  "Up to this point, most of AIs funding had gone to projects that used highlevel symbols to represent mental objects like plans, goals, beliefs, and known facts.",
  "In the 1980s, some researchers began to doubt that this approach would be able to imitate all the processes of human cognition, especially perception, robotics, learning and pattern recognition, and began to look into subsymbolic approaches.",
  "Rodney Brooks rejected representation in general and focussed directly on engineering machines that move and survive.",
  "Judea Pearl, Lotfi Zadeh, and others developed methods that handled incomplete and uncertain information by making reasonable guesses rather than precise logic.",
  "But the most important development was the revival of connectionism, including neural network research, by Geoffrey Hinton and others.",
  "In 1990, Yann LeCun successfully showed that convolutional neural networks can recognize handwritten digits, the first of many successful applications of neural networks.",
  "AI gradually restored its reputation in the late 1990s and early 21st century by exploiting formal mathematical methods and by finding specific solutions to specific problems.",
  "This narrow and formal focus allowed researchers to produce verifiable results and collaborate with other fields .",
  "By 2000, solutions developed by AI researchers were being widely used, although in the 1990s they were rarely described as artificial intelligence .",
  "However, several academic researchers became concerned that AI was no longer pursuing its original goal of creating versatile, fully intelligent machines.",
  "Beginning around 2002, they founded the subfield of artificial general intelligence , which had several wellfunded institutions by the 2010s.",
  "Deep learning began to dominate industry benchmarks in 2012 and was adopted throughout the field.",
  "For many specific tasks, other methods were abandoned.",
  "Deep learnings success was based on both hardware improvements and access to large amounts of data .",
  "Deep learnings success led to an enormous increase in interest and funding in AI.",
  "The amount of machine learning research increased by 50 in the years 20152019.",
  "In 2016, issues of fairness and the misuse of technology were catapulted into center stage at machine learning conferences, publications vastly increased, funding became available, and many researchers refocussed their careers on these issues.",
  "The alignment problem became a serious field of academic study.",
  "In the late 2010s and early 2020s, AGI companies began to deliver programs that created enormous interest.",
  "In 2015, AlphaGo, developed by DeepMind, beat the world champion Go player.",
  "The program taught only the games rules and developed a strategy by itself.",
  "GPT3 is a large language model that was released in 2020 by OpenAI and is capable of generating highquality humanlike text.",
  "ChatGPT, launched on November 30, 2022, became the fastestgrowing consumer software application in history, gaining over 100 million users in two months.",
  "It marked what is widely regarded as AIs breakout year, bringing it into the public consciousness.",
  "These programs, and others, inspired an aggressive AI boom, where large companies began investing billions of dollars in AI research.",
  "According to AI Impacts, about US50 billion annually was invested in AI around 2022 in the U.",
  "alone and about 20 of the new U.",
  "Computer Science PhD graduates have specialized in AI.",
  "About 800,000 AIrelated U.",
  "job openings existed in 2022.",
  "According to PitchBook research, 22 of newly funded startups in 2024 claimed to be AI companies.",
  "Philosophical debates have historically sought to determine the nature of intelligence and how to make intelligent machines.",
  "Another major focus has been whether machines can be conscious, and the associated ethical implications.",
  "Many other topics in philosophy are relevant to AI, such as epistemology and free will.",
  "Rapid advancements have intensified public discussions on the philosophy and ethics of AI.",
  "Alan Turing wrote in 1950 I propose to consider the question can machines think?",
  "He advised changing the question from whether a machine thinks, to whether or not it is possible for machinery to show intelligent behaviour.",
  "He devised the Turing test, which measures the ability of a machine to simulate human conversation.",
  "Since we can only observe the behavior of the machine, it does not matter if it is actually thinking or literally has a mind.",
  "Turing notes that we can not determine these things about other people but it is usual to have a polite convention that everyone thinks.",
  "Russell and Norvig agree with Turing that intelligence must be defined in terms of external behavior, not internal structure.",
  "However, they are critical that the test requires the machine to imitate humans.",
  "Aeronautical engineering texts, they wrote, do not define the goal of their field as making machines that fly so exactly like pigeons that they can fool other pigeons.",
  "AI founder John McCarthy agreed, writing that Artificial intelligence is not, by definition, simulation of human intelligence.",
  "McCarthy defines intelligence as the computational part of the ability to achieve goals in the world.",
  "Another AI founder, Marvin Minsky, similarly describes it as the ability to solve hard problems.",
  "The leading AI textbook defines it as the study of agents that perceive their environment and take actions that maximize their chances of achieving defined goals.",
  "These definitions view intelligence in terms of welldefined problems with welldefined solutions, where both the difficulty of the problem and the performance of the program are direct measures of the intelligence of the machineand no other philosophical discussion is required, or may not even be possible.",
  "Another definition has been adopted by Google, a major practitioner in the field of AI.",
  "This definition stipulates the ability of systems to synthesize information as the manifestation of intelligence, similar to the way it is defined in biological intelligence.",
  "Some authors have suggested in practice, that the definition of AI is vague and difficult to define, with contention as to whether classical algorithms should be categorised as AI, with many companies during the early 2020s AI boom using the term as a marketing buzzword, often even if they did not actually use AI in a material way.",
  "No established unifying theory or paradigm has guided AI research for most of its history.",
  "The unprecedented success of statistical machine learning in the 2010s eclipsed all other approaches .",
  "This approach is mostly subsymbolic, soft and narrow.",
  "Critics argue that these questions may have to be revisited by future generations of AI researchers.",
  "Symbolic AI and its limits Symbolic AI simulated the highlevel conscious reasoning that people use when they solve puzzles, express legal reasoning and do mathematics.",
  "They were highly successful at intelligent tasks such as algebra or IQ tests.",
  "In the 1960s, Newell and Simon proposed the physical symbol systems hypothesis A physical symbol system has the necessary and sufficient means of general intelligent action.",
  "However, the symbolic approach failed on many tasks that humans solve easily, such as learning, recognizing an object or commonsense reasoning.",
  "Moravecs paradox is the discovery that highlevel intelligent tasks were easy for AI, but low level instinctive tasks were extremely difficult.",
  "Philosopher Hubert Dreyfus had argued since the 1960s that human expertise depends on unconscious instinct rather than conscious symbol manipulation, and on having a feel for the situation, rather than explicit symbolic knowledge.",
  "Although his arguments had been ridiculed and ignored when they were first presented, eventually, AI research came to agree with him.",
  "The issue is not resolved subsymbolic reasoning can make many of the same inscrutable mistakes that human intuition does, such as algorithmic bias.",
  "Critics such as Noam Chomsky argue continuing research into symbolic AI will still be necessary to attain general intelligence, in part because subsymbolic AI is a move away from explainable AI it can be difficult or impossible to understand why a modern statistical AI program made a particular decision.",
  "The emerging field of neurosymbolic artificial intelligence attempts to bridge the two approaches.",
  "scruffy Neats hope that intelligent behavior is described using simple, elegant principles .",
  "Scruffies expect that it necessarily requires solving a large number of unrelated problems.",
  "Neats defend their programs with theoretical rigor, scruffies rely mainly on incremental testing to see if they work.",
  "This issue was actively discussed in the 1970s and 1980s, but eventually was seen as irrelevant.",
  "Modern AI has elements of both.",
  "hard computing Finding a provably correct or optimal solution is intractable for many important problems.",
  "Soft computing is a set of techniques, including genetic algorithms, fuzzy logic and neural networks, that are tolerant of imprecision, uncertainty, partial truth and approximation.",
  "Soft computing was introduced in the late 1980s and most successful AI programs in the 21st century are examples of soft computing with neural networks.",
  "general AI AI researchers are divided as to whether to pursue the goals of artificial general intelligence and superintelligence directly or to solve as many specific problems as possible in hopes these solutions will lead indirectly to the fields longterm goals.",
  "General intelligence is difficult to define and difficult to measure, and modern AI has had more verifiable successes by focusing on specific problems with specific solutions.",
  "The subfield of artificial general intelligence studies this area exclusively.",
  "There is no settled consensus in philosophy of mind on whether a machine can have a mind, consciousness and mental states in the same sense that human beings do.",
  "This issue considers the internal experiences of the machine, rather than its external behavior.",
  "Mainstream AI research considers this issue irrelevant because it does not affect the goals of the field to build machines that can solve problems using intelligence.",
  "Russell and Norvig add that he additional project of making a machine conscious in exactly the way humans are is not one that we are equipped to take on.",
  "However, the question has become central to the philosophy of mind.",
  "It is also typically the central question at issue in artificial intelligence in fiction.",
  "Consciousness David Chalmers identified two problems in understanding the mind, which he named the hard and easy problems of consciousness.",
  "The easy problem is understanding how the brain processes signals, makes plans and controls behavior.",
  "The hard problem is explaining how this feels or why it should feel like anything at all, assuming we are right in thinking that it truly does feel like something .",
  "While human information processing is easy to explain, human subjective experience is difficult to explain.",
  "For example, it is easy to imagine a colorblind person who has learned to identify which objects in their field of view are red, but it is not clear what would be required for the person to know what red looks like.",
  "Computationalism and functionalism Computationalism is the position in the philosophy of mind that the human mind is an information processing system and that thinking is a form of computing.",
  "Computationalism argues that the relationship between mind and body is similar or identical to the relationship between software and hardware and thus may be a solution to the mindbody problem.",
  "This philosophical position was inspired by the work of AI researchers and cognitive scientists in the 1960s and was originally proposed by philosophers Jerry Fodor and Hilary Putnam.",
  "Philosopher John Searle characterized this position as strong AI The appropriately programmed computer with the right inputs and outputs would thereby have a mind in exactly the same sense human beings have minds.",
  "Searle challenges this claim with his Chinese room argument, which attempts to show that even a computer capable of perfectly simulating human behavior would not have a mind.",
  "AI welfare and rights It is difficult or impossible to reliably evaluate whether an advanced AI is sentient , and if so, to what degree.",
  "But if there is a significant chance that a given machine can feel and suffer, then it may be entitled to certain rights or welfare protection measures, similarly to animals.",
  "Sapience may provide another moral basis for AI rights.",
  "Robot rights are also sometimes proposed as a practical way to integrate autonomous agents into society.",
  "In 2017, the European Union considered granting electronic personhood to some of the most capable AI systems.",
  "Similarly to the legal status of companies, it would have conferred rights but also responsibilities.",
  "Critics argued in 2018 that granting rights to AI systems would downplay the importance of human rights, and that legislation should focus on user needs rather than speculative futuristic scenarios.",
  "They also noted that robots lacked the autonomy to take part in society on their own.",
  "Progress in AI increased interest in the topic.",
  "Proponents of AI welfare and rights often argue that AI sentience, if it emerges, would be particularly easy to deny.",
  "They warn that this may be a moral blind spot analogous to slavery or factory farming, which could lead to largescale suffering if sentient AI is created and carelessly exploited.",
  "A superintelligence is a hypothetical agent that would possess intelligence far surpassing that of the brightest and most gifted human mind.",
  "If research into artificial general intelligence produced sufficiently intelligent software, it might be able to reprogram and improve itself.",
  "The improved software would be even better at improving itself, leading to what I.",
  "Good called an intelligence explosion and Vernor Vinge called a singularity.",
  "However, technologies cannot improve exponentially indefinitely, and typically follow an Sshaped curve, slowing when they reach the physical limits of what the technology can do.",
  "Robot designer Hans Moravec, cyberneticist Kevin Warwick and inventor Ray Kurzweil have predicted that humans and machines may merge in the future into cyborgs that are more capable and powerful than either.",
  "This idea, called transhumanism, has roots in the writings of Aldous Huxley and Robert Ettinger.",
  "Edward Fredkin argues that artificial intelligence is the next step in evolution, an idea first proposed by Samuel Butlers Darwin among the Machines as far back as 1863, and expanded upon by George Dyson in his 1998 book Darwin Among the Machines The Evolution of Global Intelligence.",
  "Thoughtcapable artificial beings have appeared as storytelling devices since antiquity, and have been a persistent theme in science fiction.",
  "A common trope in these works began with Mary Shelleys Frankenstein, where a human creation becomes a threat to its masters.",
  "This includes such works as Arthur C.",
  "Clarkes and Stanley Kubricks 2001 A Space Odyssey , with HAL 9000, the murderous computer in charge of the Discovery One spaceship, as well as The Terminator and The Matrix .",
  "In contrast, the rare loyal robots such as Gort from The Day the Earth Stood Still and Bishop from Aliens are less prominent in popular culture.",
  "Isaac Asimov introduced the Three Laws of Robotics in many stories, most notably with the Multivac superintelligent computer.",
  "Asimovs laws are often brought up during lay discussions of machine ethics while almost all artificial intelligence researchers are familiar with Asimovs laws through popular culture, they generally consider the laws useless for many reasons, one of which is their ambiguity.",
  "Several works use AI to force us to confront the fundamental question of what makes us human, showing us artificial beings that have the ability to feel, and thus to suffer.",
  "This appears in Karel apeks R.",
  "Artificial Intelligence and Ex Machina, as well as the novel Do Androids Dream of Electric Sheep?",
  "Dick considers the idea that our understanding of human subjectivity is altered by technology created with artificial intelligence.",
  "Artificial consciousness Field in cognitive science Artificial intelligence and elections Use and impact of AI on political elections Artificial intelligence content detection Software to detect AIgenerated content Behavior selection algorithm Algorithm that selects actions for intelligent agents Business process automation Automation of business processes Casebased reasoning Process of solving new problems based on the solutions of similar past problems Computational intelligence Ability of a computer to learn a specific task from data or experimental observation Digital immortality Hypothetical concept of storing a personality in digital form Emergent algorithm Algorithm exhibiting emergent behavior Female gendering of AI technologies Gender biases in digital technologyPages displaying short descriptions of redirect targets Glossary of artificial intelligence List of definitions of terms and concepts commonly used in the study of artificial intelligence Intelligence amplification Use of information technology to augment human intelligence Intelligent agent Software agent which acts autonomously Intelligent automation Software process that combines robotic process automation and artificial intelligence Mind uploading Hypothetical process of digitally emulating a brain Organoid intelligence Use of brain cells and brain organoids for intelligent computing Robotic process automation Form of business process automation technology The Last Day 1967 Welsh science fiction novel Wetware computer Computer composed of organic material DARWIN EU A European Union initiative coordinated by the European Medicines Agency to generate and utilize realworld evidence to support the evaluation and supervision of medicines across the EU.",
  "The two most widely used textbooks in 2023 Russell, Stuart J.",
  "Artificial Intelligence A Modern Approach .",
  "Rich, Elaine Knight, Kevin Nair, Shivashankar B .",
  "Artificial Intelligence .",
  "New Delhi Tata McGraw Hill India.",
  "The four most widely used AI textbooks in 2008 Other textbooks Ertel, Wolfgang .",
  "Introduction to Artificial Intelligence .",
  "Ciaramella, Alberto Ciaramella, Marco .",
  "Introduction to Artificial Intelligence from data analysis to generative AI .",
  "Intellisemantic Editions.",
  "Artificial Intelligence.",
  "Internet Encyclopedia of Philosophy.",
  "Machine learning is a field of study in artificial intelligence concerned with the development and study of statistical algorithms that can learn from data and generalise to unseen data, and thus perform tasks without explicit instructions.",
  "Within a subdiscipline in machine learning, advances in the field of deep learning have allowed neural networks, a class of statistical algorithms, to surpass many previous machine learning approaches in performance.",
  "ML finds application in many fields, including natural language processing, computer vision, speech recognition, email filtering, agriculture, and medicine.",
  "The application of ML to business problems is known as predictive analytics.",
  "Statistics and mathematical optimisation methods comprise the foundations of machine learning.",
  "Data mining is a related field of study, focusing on exploratory data analysis via unsupervised learning.",
  "From a theoretical viewpoint, probably approximately correct learning provides a framework for describing machine learning.",
  "The term machine learning was coined in 1959 by Arthur Samuel, an IBM employee and pioneer in the field of computer gaming and artificial intelligence.",
  "The synonym selfteaching computers was also used in this time period.",
  "The earliest machine learning program was introduced in the 1950s when Arthur Samuel invented a computer program that calculated the winning chance in checkers for each side, but the history of machine learning roots back to decades of human desire and effort to study human cognitive processes.",
  "In 1949, Canadian psychologist Donald Hebb published the book The Organization of Behavior, in which he introduced a theoretical neural structure formed by certain interactions among nerve cells.",
  "Hebbs model of neurons interacting with one another set a groundwork for how AIs and machine learning algorithms work under nodes, or artificial neurons used by computers to communicate data.",
  "Other researchers who have studied human cognitive systems contributed to the modern machine learning technologies as well, including logician Walter Pitts and Warren McCulloch, who proposed the early mathematical models of neural networks to come up with algorithms that mirror human thought processes.",
  "By the early 1960s, an experimental learning machine with punched tape memory, called Cybertron, had been developed by Raytheon Company to analyse sonar signals, electrocardiograms, and speech patterns using rudimentary reinforcement learning.",
  "It was repetitively trained by a human operatorteacher to recognise patterns and equipped with a goof button to cause it to reevaluate incorrect decisions.",
  "A representative book on research into machine learning during the 1960s was Nilssons book on Learning Machines, dealing mostly with machine learning for pattern classification.",
  "Interest related to pattern recognition continued into the 1970s, as described by Duda and Hart in 1973.",
  "In 1981 a report was given on using teaching strategies so that an artificial neural network learns to recognise 40 characters from a computer terminal.",
  "Mitchell provided a widely quoted, more formal definition of the algorithms studied in the machine learning field A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P if its performance at tasks in T, as measured by P, improves with experience E.",
  "This definition of the tasks in which machine learning is concerned offers a fundamentally operational definition rather than defining the field in cognitive terms.",
  "This follows Alan Turings proposal in his paper Computing Machinery and Intelligence, in which the question Can machines think?",
  "is replaced with the question Can machines do what we can do?.",
  "Modernday machine learning has two objectives.",
  "One is to classify data based on models which have been developed the other purpose is to make predictions for future outcomes based on these models.",
  "A hypothetical algorithm specific to classifying data may use computer vision of moles coupled with supervised learning in order to train it to classify the cancerous moles.",
  "A machine learning algorithm for stock trading may inform the trader of future potential predictions.",
  "As a scientific endeavour, machine learning grew out of the quest for artificial intelligence .",
  "In the early days of AI as an academic discipline, some researchers were interested in having machines learn from data.",
  "They attempted to approach the problem with various symbolic methods, as well as what were then termed neural networks these were mostly perceptrons and other models that were later found to be reinventions of the generalised linear models of statistics.",
  "Probabilistic reasoning was also employed, especially in automated medical diagnosis.",
  "488 However, an increasing emphasis on the logical, knowledgebased approach caused a rift between AI and machine learning.",
  "Probabilistic systems were plagued by theoretical and practical problems of data acquisition and representation.",
  "488 By 1980, expert systems had come to dominate AI, and statistics was out of favour.",
  "Work on symbolicknowledgebased learning did continue within AI, leading to inductive logic programming, but the more statistical line of research was now outside the field of AI proper, in pattern recognition and information retrieval.",
  "708710, 755 Neural networks research had been abandoned by AI and computer science around the same time.",
  "This line, too, was continued outside the AICS field, as connectionism, by researchers from other disciplines including John Hopfield, David Rumelhart, and Geoffrey Hinton.",
  "Their main success came in the mid1980s with the reinvention of backpropagation.",
  "25 Machine learning , reorganised and recognised as its own field, started to flourish in the 1990s.",
  "The field changed its goal from achieving artificial intelligence to tackling solvable problems of a practical nature.",
  "It shifted focus away from the symbolic approaches it had inherited from AI, and toward methods and models borrowed from statistics, fuzzy logic, and probability theory.",
  "Machine learning and data mining often employ the same methods and overlap significantly, but while machine learning focuses on prediction, based on known properties learned from the training data, data mining focuses on the discovery of unknown properties in the data .",
  "Data mining uses many machine learning methods, but with different goals on the other hand, machine learning also employs data mining methods as unsupervised learning or as a preprocessing step to improve learner accuracy.",
  "Much of the confusion between these two research communities comes from the basic assumptions they work with in machine learning, performance is usually evaluated with respect to the ability to reproduce known knowledge, while in knowledge discovery and data mining the key task is the discovery of previously unknown knowledge.",
  "Evaluated with respect to known knowledge, an uninformed method will easily be outperformed by other supervised methods, while in a typical KDD task, supervised methods cannot be used due to the unavailability of training data.",
  "Machine learning also has intimate ties to optimisation Many learning problems are formulated as minimisation of some loss function on a training set of examples.",
  "Loss functions express the discrepancy between the predictions of the model being trained and the actual problem instances .",
  "Characterizing the generalisation of various learning algorithms is an active topic of current research, especially for deep learning algorithms.",
  "Machine learning and statistics are closely related fields in terms of methods, but distinct in their principal goal statistics draws population inferences from a sample, while machine learning finds generalisable predictive patterns.",
  "According to Michael I.",
  "Jordan, the ideas of machine learning, from methodological principles to theoretical tools, have had a long prehistory in statistics.",
  "He also suggested the term data science as a placeholder to call the overall field.",
  "Conventional statistical analyses require the a priori selection of a model most suitable for the study data set.",
  "In addition, only significant or theoretically relevant variables based on previous experience are included for analysis.",
  "In contrast, machine learning is not built on a prestructured model rather, the data shape the model by detecting underlying patterns.",
  "The more variables used to train the model, the more accurate the ultimate model will be.",
  "Leo Breiman distinguished two statistical modelling paradigms data model and algorithmic model, wherein algorithmic model means more or less the machine learning algorithms like Random Forest.",
  "Some statisticians have adopted methods from machine learning, leading to a combined field that they call statistical learning.",
  "Analytical and computational techniques derived from deeprooted physics of disordered systems can be extended to largescale problems, including machine learning, e.",
  ", to analyse the weight space of deep neural networks.",
  "Statistical physics is thus finding applications in the area of medical diagnostics.",
  "A core objective of a learner is to generalise from its experience.",
  "Generalisation in this context is the ability of a learning machine to perform accurately on new, unseen examplestasks after having experienced a learning data set.",
  "The training examples come from some generally unknown probability distribution and the learner has to build a general model about this space that enables it to produce sufficiently accurate predictions in new cases.",
  "The computational analysis of machine learning algorithms and their performance is a branch of theoretical computer science known as computational learning theory via the probably approximately correct learning model.",
  "Because training sets are finite and the future is uncertain, learning theory usually does not yield guarantees of the performance of algorithms.",
  "Instead, probabilistic bounds on the performance are quite common.",
  "The biasvariance decomposition is one way to quantify generalisation error.",
  "For the best performance in the context of generalisation, the complexity of the hypothesis should match the complexity of the function underlying the data.",
  "If the hypothesis is less complex than the function, then the model has under fitted the data.",
  "If the complexity of the model is increased in response, then the training error decreases.",
  "But if the hypothesis is too complex, then the model is subject to overfitting and generalisation will be poorer.",
  "In addition to performance bounds, learning theorists study the time complexity and feasibility of learning.",
  "In computational learning theory, a computation is considered feasible if it can be done in polynomial time.",
  "There are two kinds of time complexity results Positive results show that a certain class of functions can be learned in polynomial time.",
  "Negative results show that certain classes cannot be learned in polynomial time.",
  "Machine learning approaches are traditionally divided into three broad categories, which correspond to learning paradigms, depending on the nature of the signal or feedback available to the learning system Supervised learning The computer is presented with example inputs and their desired outputs, given by a teacher, and the goal is to learn a general rule that maps inputs to outputs.",
  "Unsupervised learning No labels are given to the learning algorithm, leaving it on its own to find structure in its input.",
  "Unsupervised learning can be a goal in itself or a means towards an end .",
  "Reinforcement learning A computer program interacts with a dynamic environment in which it must perform a certain goal .",
  "As it navigates its problem space, the program is provided feedback thats analogous to rewards, which it tries to maximise.",
  "Although each algorithm has advantages and limitations, no single algorithm works for all problems.",
  "Supervised learning algorithms build a mathematical model of a set of data that contains both the inputs and the desired outputs.",
  "The data, known as training data, consists of a set of training examples.",
  "Each training example has one or more inputs and the desired output, also known as a supervisory signal.",
  "In the mathematical model, each training example is represented by an array or vector, sometimes called a feature vector, and the training data is represented by a matrix.",
  "Through iterative optimisation of an objective function, supervised learning algorithms learn a function that can be used to predict the output associated with new inputs.",
  "An optimal function allows the algorithm to correctly determine the output for inputs that were not a part of the training data.",
  "An algorithm that improves the accuracy of its outputs or predictions over time is said to have learned to perform that task.",
  "Types of supervisedlearning algorithms include active learning, classification and regression.",
  "Classification algorithms are used when the outputs are restricted to a limited set of values, while regression algorithms are used when the outputs can take any numerical value within a range.",
  "For example, in a classification algorithm that filters emails, the input is an incoming email, and the output is the folder in which to file the email.",
  "In contrast, regression is used for tasks such as predicting a persons height based on factors like age and genetics or forecasting future temperatures based on historical data.",
  "Similarity learning is an area of supervised machine learning closely related to regression and classification, but the goal is to learn from examples using a similarity function that measures how similar or related two objects are.",
  "It has applications in ranking, recommendation systems, visual identity tracking, face verification, and speaker verification.",
  "Unsupervised learning algorithms find structures in data that has not been labelled, classified or categorised.",
  "Instead of responding to feedback, unsupervised learning algorithms identify commonalities in the data and react based on the presence or absence of such commonalities in each new piece of data.",
  "Central applications of unsupervised machine learning include clustering, dimensionality reduction, and density estimation.",
  "Cluster analysis is the assignment of a set of observations into subsets so that observations within the same cluster are similar according to one or more predesignated criteria, while observations drawn from different clusters are dissimilar.",
  "Different clustering techniques make different assumptions on the structure of the data, often defined by some similarity metric and evaluated, for example, by internal compactness, or the similarity between members of the same cluster, and separation, the difference between clusters.",
  "Other methods are based on estimated density and graph connectivity.",
  "A special type of unsupervised learning called, selfsupervised learning involves training a model by generating the supervisory signal from the data itself.",
  "Semisupervised learning falls between unsupervised learning and supervised learning .",
  "Some of the training examples are missing training labels, yet many machinelearning researchers have found that unlabelled data, when used in conjunction with a small amount of labelled data, can produce a considerable improvement in learning accuracy.",
  "In weakly supervised learning, the training labels are noisy, limited, or imprecise however, these labels are often cheaper to obtain, resulting in larger effective training sets.",
  "Reinforcement learning is an area of machine learning concerned with how software agents ought to take actions in an environment so as to maximise some notion of cumulative reward.",
  "Due to its generality, the field is studied in many other disciplines, such as game theory, control theory, operations research, information theory, simulationbased optimisation, multiagent systems, swarm intelligence, statistics and genetic algorithms.",
  "In reinforcement learning, the environment is typically represented as a Markov decision process .",
  "Many reinforcement learning algorithms use dynamic programming techniques.",
  "Reinforcement learning algorithms do not assume knowledge of an exact mathematical model of the MDP and are used when exact models are infeasible.",
  "Reinforcement learning algorithms are used in autonomous vehicles or in learning to play a game against a human opponent.",
  "Dimensionality reduction is a process of reducing the number of random variables under consideration by obtaining a set of principal variables.",
  "In other words, it is a process of reducing the dimension of the feature set, also called the number of features.",
  "Most of the dimensionality reduction techniques can be considered as either feature elimination or extraction.",
  "One of the popular methods of dimensionality reduction is principal component analysis .",
  "PCA involves changing higherdimensional data to a smaller space .",
  "The manifold hypothesis proposes that highdimensional data sets lie along lowdimensional manifolds, and many dimensionality reduction techniques make this assumption, leading to the area of manifold learning and manifold regularisation.",
  "Other approaches have been developed which do not fit neatly into this threefold categorisation, and sometimes more than one is used by the same machine learning system.",
  "For example, topic modelling, metalearning.",
  "Selflearning Selflearning, as a machine learning paradigm was introduced in 1982 along with a neural network capable of selflearning, named crossbar adaptive array .",
  "It gives a solution to the problem learning without any external reward, by introducing emotion as an internal reward.",
  "Emotion is used as state evaluation of a selflearning agent.",
  "The CAA selflearning algorithm computes, in a crossbar fashion, both decisions about actions and emotions about consequence situations.",
  "The system is driven by the interaction between cognition and emotion.",
  "The selflearning algorithm updates a memory matrix W w such that in each iteration executes the following machine learning routine in situation s perform action a receive a consequence situation s compute emotion of being in the consequence situation v update crossbar memory w w v It is a system with only one input, situation, and only one output, action a.",
  "There is neither a separate reinforcement input nor an advice input from the environment.",
  "The backpropagated value is the emotion toward the consequence situation.",
  "The CAA exists in two environments, one is the behavioural environment where it behaves, and the other is the genetic environment, wherefrom it initially and only once receives initial emotions about situations to be encountered in the behavioural environment.",
  "After receiving the genome vector from the genetic environment, the CAA learns a goalseeking behaviour, in an environment that contains both desirable and undesirable situations.",
  "Feature learning Several learning algorithms aim at discovering better representations of the inputs provided during training.",
  "Classic examples include principal component analysis and cluster analysis.",
  "Feature learning algorithms, also called representation learning algorithms, often attempt to preserve the information in their input but also transform it in a way that makes it useful, often as a preprocessing step before performing classification or predictions.",
  "This technique allows reconstruction of the inputs coming from the unknown datagenerating distribution, while not being necessarily faithful to configurations that are implausible under that distribution.",
  "This replaces manual feature engineering, and allows a machine to both learn the features and use them to perform a specific task.",
  "Feature learning can be either supervised or unsupervised.",
  "In supervised feature learning, features are learned using labelled input data.",
  "Examples include artificial neural networks, multilayer perceptrons, and supervised dictionary learning.",
  "In unsupervised feature learning, features are learned with unlabelled input data.",
  "Examples include dictionary learning, independent component analysis, autoencoders, matrix factorisation and various forms of clustering.",
  "Manifold learning algorithms attempt to do so under the constraint that the learned representation is lowdimensional.",
  "Sparse coding algorithms attempt to do so under the constraint that the learned representation is sparse, meaning that the mathematical model has many zeros.",
  "Multilinear subspace learning algorithms aim to learn lowdimensional representations directly from tensor representations for multidimensional data, without reshaping them into higherdimensional vectors.",
  "Deep learning algorithms discover multiple levels of representation, or a hierarchy of features, with higherlevel, more abstract features defined in terms of lowerlevel features.",
  "It has been argued that an intelligent machine is one that learns a representation that disentangles the underlying factors of variation that explain the observed data.",
  "Feature learning is motivated by the fact that machine learning tasks such as classification often require input that is mathematically and computationally convenient to process.",
  "However, realworld data such as images, video, and sensory data has not yielded attempts to algorithmically define specific features.",
  "An alternative is to discover such features or representations through examination, without relying on explicit algorithms.",
  "Sparse dictionary learning Sparse dictionary learning is a feature learning method where a training example is represented as a linear combination of basis functions and assumed to be a sparse matrix.",
  "The method is strongly NPhard and difficult to solve approximately.",
  "A popular heuristic method for sparse dictionary learning is the kSVD algorithm.",
  "Sparse dictionary learning has been applied in several contexts.",
  "In classification, the problem is to determine the class to which a previously unseen training example belongs.",
  "For a dictionary where each class has already been built, a new training example is associated with the class that is best sparsely represented by the corresponding dictionary.",
  "Sparse dictionary learning has also been applied in image denoising.",
  "The key idea is that a clean image patch can be sparsely represented by an image dictionary, but the noise cannot.",
  "Anomaly detection In data mining, anomaly detection, also known as outlier detection, is the identification of rare items, events or observations which raise suspicions by differing significantly from the majority of the data.",
  "Typically, the anomalous items represent an issue such as bank fraud, a structural defect, medical problems or errors in a text.",
  "Anomalies are referred to as outliers, novelties, noise, deviations and exceptions.",
  "In particular, in the context of abuse and network intrusion detection, the interesting objects are often not rare objects, but unexpected bursts of inactivity.",
  "This pattern does not adhere to the common statistical definition of an outlier as a rare object.",
  "Many outlier detection methods will fail on such data unless aggregated appropriately.",
  "Instead, a cluster analysis algorithm may be able to detect the microclusters formed by these patterns.",
  "Three broad categories of anomaly detection techniques exist.",
  "Unsupervised anomaly detection techniques detect anomalies in an unlabelled test data set under the assumption that the majority of the instances in the data set are normal, by looking for instances that seem to fit the least to the remainder of the data set.",
  "Supervised anomaly detection techniques require a data set that has been labelled as normal and abnormal and involves training a classifier .",
  "Semisupervised anomaly detection techniques construct a model representing normal behaviour from a given normal training data set and then test the likelihood of a test instance to be generated by the model.",
  "Robot learning Robot learning is inspired by a multitude of machine learning methods, starting from supervised learning, reinforcement learning, and finally metalearning .",
  "Association rules Association rule learning is a rulebased machine learning method for discovering relationships between variables in large databases.",
  "It is intended to identify strong rules discovered in databases using some measure of interestingness.",
  "Rulebased machine learning is a general term for any machine learning method that identifies, learns, or evolves rules to store, manipulate or apply knowledge.",
  "The defining characteristic of a rulebased machine learning algorithm is the identification and utilisation of a set of relational rules that collectively represent the knowledge captured by the system.",
  "This is in contrast to other machine learning algorithms that commonly identify a singular model that can be universally applied to any instance in order to make a prediction.",
  "Rulebased machine learning approaches include learning classifier systems, association rule learning, and artificial immune systems.",
  "Based on the concept of strong rules, Rakesh Agrawal, Tomasz Imieliski and Arun Swami introduced association rules for discovering regularities between products in largescale transaction data recorded by pointofsale systems in supermarkets.",
  "For example, the rule o n i o n s , p o t a t o e s b u r g e r Rightarrow found in the sales data of a supermarket would indicate that if a customer buys onions and potatoes together, they are likely to also buy hamburger meat.",
  "Such information can be used as the basis for decisions about marketing activities such as promotional pricing or product placements.",
  "In addition to market basket analysis, association rules are employed today in application areas including Web usage mining, intrusion detection, continuous production, and bioinformatics.",
  "In contrast with sequence mining, association rule learning typically does not consider the order of items either within a transaction or across transactions.",
  "Learning classifier systems are a family of rulebased machine learning algorithms that combine a discovery component, typically a genetic algorithm, with a learning component, performing either supervised learning, reinforcement learning, or unsupervised learning.",
  "They seek to identify a set of contextdependent rules that collectively store and apply knowledge in a piecewise manner in order to make predictions.",
  "Inductive logic programming is an approach to rule learning using logic programming as a uniform representation for input examples, background knowledge, and hypotheses.",
  "Given an encoding of the known background knowledge and a set of examples represented as a logical database of facts, an ILP system will derive a hypothesized logic program that entails all positive and no negative examples.",
  "Inductive programming is a related field that considers any kind of programming language for representing hypotheses , such as functional programs.",
  "Inductive logic programming is particularly useful in bioinformatics and natural language processing.",
  "Gordon Plotkin and Ehud Shapiro laid the initial theoretical foundation for inductive machine learning in a logical setting.",
  "Shapiro built their first implementation in 1981 a Prolog program that inductively inferred logic programs from positive and negative examples.",
  "The term inductive here refers to philosophical induction, suggesting a theory to explain observed facts, rather than mathematical induction, proving a property for all members of a wellordered set.",
  "A machine learning model is a type of mathematical model that, once trained on a given dataset, can be used to make predictions or classifications on new data.",
  "During training, a learning algorithm iteratively adjusts the models internal parameters to minimise errors in its predictions.",
  "By extension, the term model can refer to several levels of specificity, from a general class of models and their associated learning algorithms to a fully trained model with all its internal parameters tuned.",
  "Various types of models have been used and researched for machine learning systems, picking the best model for a task is called model selection.",
  "Artificial neural networks , or connectionist systems, are computing systems vaguely inspired by the biological neural networks that constitute animal brains.",
  "Such systems learn to perform tasks by considering examples, generally without being programmed with any taskspecific rules.",
  "An ANN is a model based on a collection of connected units or nodes called artificial neurons, which loosely model the neurons in a biological brain.",
  "Each connection, like the synapses in a biological brain, can transmit information, a signal, from one artificial neuron to another.",
  "An artificial neuron that receives a signal can process it and then signal additional artificial neurons connected to it.",
  "In common ANN implementations, the signal at a connection between artificial neurons is a real number, and the output of each artificial neuron is computed by some nonlinear function of the sum of its inputs.",
  "The connections between artificial neurons are called edges.",
  "Artificial neurons and edges typically have a weight that adjusts as learning proceeds.",
  "The weight increases or decreases the strength of the signal at a connection.",
  "Artificial neurons may have a threshold such that the signal is only sent if the aggregate signal crosses that threshold.",
  "Typically, artificial neurons are aggregated into layers.",
  "Different layers may perform different kinds of transformations on their inputs.",
  "Signals travel from the first layer to the last layer , possibly after traversing the layers multiple times.",
  "The original goal of the ANN approach was to solve problems in the same way that a human brain would.",
  "However, over time, attention moved to performing specific tasks, leading to deviations from biology.",
  "Artificial neural networks have been used on a variety of tasks, including computer vision, speech recognition, machine translation, social network filtering, playing board and video games and medical diagnosis.",
  "Deep learning consists of multiple hidden layers in an artificial neural network.",
  "This approach tries to model the way the human brain processes light and sound into vision and hearing.",
  "Some successful applications of deep learning are computer vision and speech recognition.",
  "Decision tree learning uses a decision tree as a predictive model to go from observations about an item to conclusions about the items target value .",
  "It is one of the predictive modelling approaches used in statistics, data mining, and machine learning.",
  "Tree models where the target variable can take a discrete set of values are called classification trees in these tree structures, leaves represent class labels, and branches represent conjunctions of features that lead to those class labels.",
  "Decision trees where the target variable can take continuous values are called regression trees.",
  "In decision analysis, a decision tree can be used to visually and explicitly represent decisions and decision making.",
  "In data mining, a decision tree describes data, but the resulting classification tree can be an input for decisionmaking.",
  "Random forest regression falls under umbrella of decision treebased models.",
  "RFR is an ensemble learning method that builds multiple decision trees and averages their predictions to improve accuracy and to avoid overfitting.",
  "To build decision trees, RFR uses bootstrapped sampling, for instance each decision tree is trained on random data of from training set.",
  "This random selection of RFR for training enables model to reduce bias predictions and achieve accuracy.",
  "RFR generates independent decision trees, and it can work on single output data as well multiple regressor task.",
  "This makes RFR compatible to be used in various application.",
  "Supportvector machines , also known as supportvector networks, are a set of related supervised learning methods used for classification and regression.",
  "Given a set of training examples, each marked as belonging to one of two categories, an SVM training algorithm builds a model that predicts whether a new example falls into one category.",
  "An SVM training algorithm is a nonprobabilistic, binary, linear classifier, although methods such as Platt scaling exist to use SVM in a probabilistic classification setting.",
  "In addition to performing linear classification, SVMs can efficiently perform a nonlinear classification using what is called the kernel trick, implicitly mapping their inputs into highdimensional feature spaces.",
  "Regression analysis encompasses a large variety of statistical methods to estimate the relationship between input variables and their associated features.",
  "Its most common form is linear regression, where a single line is drawn to best fit the given data according to a mathematical criterion such as ordinary least squares.",
  "The latter is often extended by regularisation methods to mitigate overfitting and bias, as in ridge regression.",
  "When dealing with nonlinear problems, goto models include polynomial regression , logistic regression or even kernel regression, which introduces nonlinearity by taking advantage of the kernel trick to implicitly map input variables to higherdimensional space.",
  "Multivariate linear regression extends the concept of linear regression to handle multiple dependent variables simultaneously.",
  "This approach estimates the relationships between a set of input variables and several output variables by fitting a multidimensional linear model.",
  "It is particularly useful in scenarios where outputs are interdependent or share underlying patterns, such as predicting multiple economic indicators or reconstructing images, which are inherently multidimensional.",
  "A Bayesian network, belief network, or directed acyclic graphical model is a probabilistic graphical model that represents a set of random variables and their conditional independence with a directed acyclic graph .",
  "For example, a Bayesian network could represent the probabilistic relationships between diseases and symptoms.",
  "Given symptoms, the network can be used to compute the probabilities of the presence of various diseases.",
  "Efficient algorithms exist that perform inference and learning.",
  "Bayesian networks that model sequences of variables, like speech signals or protein sequences, are called dynamic Bayesian networks.",
  "Generalisations of Bayesian networks that can represent and solve decision problems under uncertainty are called influence diagrams.",
  "A Gaussian process is a stochastic process in which every finite collection of the random variables in the process has a multivariate normal distribution, and it relies on a predefined covariance function, or kernel, that models how pairs of points relate to each other depending on their locations.",
  "Given a set of observed points, or inputoutput examples, the distribution of the output of a new point as function of its input data can be directly computed by looking like the observed points and the covariances between those points and the new, unobserved point.",
  "Gaussian processes are popular surrogate models in Bayesian optimisation used to do hyperparameter optimisation.",
  "A genetic algorithm is a search algorithm and heuristic technique that mimics the process of natural selection, using methods such as mutation and crossover to generate new genotypes in the hope of finding good solutions to a given problem.",
  "In machine learning, genetic algorithms were used in the 1980s and 1990s.",
  "Conversely, machine learning techniques have been used to improve the performance of genetic and evolutionary algorithms.",
  "The theory of belief functions, also referred to as evidence theory or DempsterShafer theory, is a general framework for reasoning with uncertainty, with understood connections to other frameworks such as probability, possibility and imprecise probability theories.",
  "These theoretical frameworks can be thought of as a kind of learner and have some analogous properties of how evidence is combined , just like how in a pmfbased Bayesian approach would combine probabilities.",
  "However, there are many caveats to these beliefs functions when compared to Bayesian approaches in order to incorporate ignorance and uncertainty quantification.",
  "These belief function approaches that are implemented within the machine learning domain typically leverage a fusion approach of various ensemble methods to better handle the learners decision boundary, low samples, and ambiguous class issues that standard machine learning approach tend to have difficulty resolving.",
  "However, the computational complexity of these algorithms are dependent on the number of propositions , and can lead to a much higher computation time when compared to other machine learning approaches.",
  "Rulebased machine learning is a branch of machine learning that automatically discovers and learns rules from data.",
  "It provides interpretable models, making it useful for decisionmaking in fields like healthcare, fraud detection, and cybersecurity.",
  "Key RBML techniques includes learning classifier systems, association rule learning, artificial immune systems, and other similar models.",
  "These methods extract patterns from data and evolve rules over time.",
  "Typically, machine learning models require a high quantity of reliable data to perform accurate predictions.",
  "When training a machine learning model, machine learning engineers need to target and collect a large and representative sample of data.",
  "Data from the training set can be as varied as a corpus of text, a collection of images, sensor data, and data collected from individual users of a service.",
  "Overfitting is something to watch out for when training a machine learning model.",
  "Trained models derived from biased or nonevaluated data can result in skewed or undesired predictions.",
  "Biased models may result in detrimental outcomes, thereby furthering the negative impacts on society or objectives.",
  "Algorithmic bias is a potential result of data not being fully prepared for training.",
  "Machine learning ethics is becoming a field of study and notably, becoming integrated within machine learning engineering teams.",
  "Federated learning Federated learning is an adapted form of distributed artificial intelligence to training machine learning models that decentralises the training process, allowing for users privacy to be maintained by not needing to send their data to a centralised server.",
  "This also increases efficiency by decentralising the training process to many devices.",
  "For example, Gboard uses federated machine learning to train search query prediction models on users mobile phones without having to send individual searches back to Google.",
  "There are many applications for machine learning, including In 2006, the mediaservices provider Netflix held the first Netflix Prize competition to find a program to better predict user preferences and improve the accuracy of its existing Cinematch movie recommendation algorithm by at least 10.",
  "A joint team made up of researchers from ATT LabsResearch in collaboration with the teams Big Chaos and Pragmatic Theory built an ensemble model to win the Grand Prize in 2009 for 1 million.",
  "Shortly after the prize was awarded, Netflix realised that viewers ratings were not the best indicators of their viewing patterns and they changed their recommendation engine accordingly.",
  "In 2010, an article in The Wall Street Journal noted the use of machine learning by Rebellion Research to predict the 2008 financial crisis.",
  "In 2012, cofounder of Sun Microsystems, Vinod Khosla, predicted that 80 of medical doctors jobs would be lost in the next two decades to automated machine learning medical diagnostic software.",
  "In 2014, it was reported that a machine learning algorithm had been applied in the field of art history to study fine art paintings and that it may have revealed previously unrecognised influences among artists.",
  "In 2019 Springer Nature published the first research book created using machine learning.",
  "In 2020, machine learning technology was used to help make diagnoses and aid researchers in developing a cure for COVID19.",
  "Machine learning was recently applied to predict the proenvironmental behaviour of travellers.",
  "Recently, machine learning technology was also applied to optimise smartphones performance and thermal behaviour based on the users interaction with the phone.",
  "When applied correctly, machine learning algorithms can utilise a wide range of company characteristics to predict stock returns without overfitting.",
  "By employing effective feature engineering and combining forecasts, MLAs can generate results that far surpass those obtained from basic linear techniques like OLS.",
  "Recent advancements in machine learning have extended into the field of quantum chemistry, where novel algorithms now enable the prediction of solvent effects on chemical reactions, thereby offering new tools for chemists to tailor experimental conditions for optimal outcomes.",
  "Machine Learning is becoming a useful tool to investigate and predict evacuation decision making in large scale and small scale disasters.",
  "Different solutions have been tested to predict if and when householders decide to evacuate during wildfires and hurricanes.",
  "Other applications have been focusing on pre evacuation decisions in building fires.",
  "Machine learning is also emerging as a promising tool in geotechnical engineering, where it is used to support tasks such as ground classification, hazard prediction, and site characterization.",
  "Recent research emphasizes a move toward datacentric methods in this field, where machine learning is not a replacement for engineering judgment, but a way to enhance it using sitespecific data and patterns.",
  "Although machine learning has been transformative in some fields, machinelearning programs often fail to deliver expected results.",
  "Reasons for this are numerous lack of data, lack of access to the data, data bias, privacy problems, badly chosen tasks and algorithms, wrong tools and people, lack of resources, and evaluation problems.",
  "The black box theory poses another yet significant challenge.",
  "Black box refers to a situation where the algorithm or the process of producing an output is entirely opaque, meaning that even the coders of the algorithm cannot audit the pattern that the machine extracted out of the data.",
  "The House of Lords Select Committee, which claimed that such an intelligence system that could have a substantial impact on an individuals life would not be considered acceptable unless it provided a full and satisfactory explanation for the decisions it makes.",
  "In 2018, a selfdriving car from Uber failed to detect a pedestrian, who was killed after a collision.",
  "Attempts to use machine learning in healthcare with the IBM Watson system failed to deliver even after years of time and billions of dollars invested.",
  "Microsofts Bing Chat chatbot has been reported to produce hostile and offensive response against its users.",
  "Machine learning has been used as a strategy to update the evidence related to a systematic review and increased reviewer burden related to the growth of biomedical literature.",
  "While it has improved with training sets, it has not yet developed sufficiently to reduce the workload burden without limiting the necessary sensitivity for the findings research themselves.",
  "Explainable AI , or Interpretable AI, or Explainable Machine Learning , is artificial intelligence in which humans can understand the decisions or predictions made by the AI.",
  "It contrasts with the black box concept in machine learning where even its designers cannot explain why an AI arrived at a specific decision.",
  "By refining the mental models of users of AIpowered systems and dismantling their misconceptions, XAI promises to help users perform more effectively.",
  "XAI may be an implementation of the social right to explanation.",
  "Settling on a bad, overly complex theory gerrymandered to fit all the past training data is known as overfitting.",
  "Many systems attempt to reduce overfitting by rewarding a theory in accordance with how well it fits the data but penalising the theory in accordance with how complex the theory is.",
  "Learners can also disappoint by learning the wrong lesson.",
  "A toy example is that an image classifier trained only on pictures of brown horses and black cats might conclude that all brown patches are likely to be horses.",
  "A realworld example is that, unlike humans, current image classifiers often do not primarily make judgements from the spatial relationship between components of the picture, and they learn relationships between pixels that humans are oblivious to, but that still correlate with images of certain types of real objects.",
  "Modifying these patterns on a legitimate image can result in adversarial images that the system misclassifies.",
  "Adversarial vulnerabilities can also result in nonlinear systems, or from nonpattern perturbations.",
  "For some systems, it is possible to change the output by only changing a single adversarially chosen pixel.",
  "Machine learning models are often vulnerable to manipulation or evasion via adversarial machine learning.",
  "Researchers have demonstrated how backdoors can be placed undetectably into classifying machine learning models that are often developed or trained by third parties.",
  "Parties can change the classification of any input, including in cases for which a type of datasoftware transparency is provided, possibly including whitebox access.",
  "Classification of machine learning models can be validated by accuracy estimation techniques like the holdout method, which splits the data in a training and test set and evaluates the performance of the training model on the test set.",
  "In comparison, the Kfoldcrossvalidation method randomly partitions the data into K subsets and then K experiments are performed each respectively considering 1 subset for evaluation and the remaining K1 subsets for training the model.",
  "In addition to the holdout and crossvalidation methods, bootstrap, which samples n instances with replacement from the dataset, can be used to assess model accuracy.",
  "In addition to overall accuracy, investigators frequently report sensitivity and specificity meaning true positive rate and true negative rate respectively.",
  "Similarly, investigators sometimes report the false positive rate as well as the false negative rate .",
  "However, these rates are ratios that fail to reveal their numerators and denominators.",
  "Receiver operating characteristic along with the accompanying Area Under the ROC Curve offer additional tools for classification model assessment.",
  "Higher AUC is associated with a better performing model.",
  "Different machine learning approaches can suffer from different data biases.",
  "A machine learning system trained specifically on current customers may not be able to predict the needs of new customer groups that are not represented in the training data.",
  "When trained on humanmade data, machine learning is likely to pick up the constitutional and unconscious biases already present in society.",
  "Systems that are trained on datasets collected with biases may exhibit these biases upon use , thus digitising cultural prejudices.",
  "For example, in 1988, the UKs Commission for Racial Equality found that St.",
  "Georges Medical School had been using a computer program trained from data of previous admissions staff and that this program had denied nearly 60 candidates who were found to either be women or have nonEuropean sounding names.",
  "Using job hiring data from a firm with racist hiring policies may lead to a machine learning system duplicating the bias by scoring job applicants by similarity to previous successful applicants.",
  "Another example includes predictive policing company Geoliticas predictive algorithm that resulted in disproportionately high levels of overpolicing in lowincome and minority communities after being trained with historical crime data.",
  "While responsible collection of data and documentation of algorithmic rules used by a system is considered a critical part of machine learning, some researchers blame lack of participation and representation of minority population in the field of AI for machine learnings vulnerability to biases.",
  "In fact, according to research carried out by the Computing Research Association in 2021, female faculty merely make up 16.1 of all faculty members who focus on AI among several universities around the world.",
  "Furthermore, among the group of new U.",
  "resident AI PhD graduates, 45 identified as white, 22.4 as Asian, 3.2 as Hispanic, and 2.4 as African American, which further demonstrates a lack of diversity in the field of AI.",
  "Language models learned from data have been shown to contain humanlike biases.",
  "Because human languages contain biases, machines trained on language corpora will necessarily also learn these biases.",
  "In 2016, Microsoft tested Tay, a chatbot that learned from Twitter, and it quickly picked up racist and sexist language.",
  "In an experiment carried out by ProPublica, an investigative journalism organisation, a machine learning algorithms insight into the recidivism rates among prisoners falsely flagged black defendants high risk twice as often as white defendants.",
  "In 2015, Google Photos once tagged a couple of black people as gorillas, which caused controversy.",
  "The gorilla label was subsequently removed, and in 2023, it still cannot recognise gorillas.",
  "Similar issues with recognising nonwhite people have been found in many other systems.",
  "Because of such challenges, the effective use of machine learning may take longer to be adopted in other domains.",
  "Concern for fairness in machine learning, that is, reducing bias in machine learning and propelling its use for human good, is increasingly expressed by artificial intelligence scientists, including FeiFei Li, who said that heres nothing artificial about AI.",
  "Its inspired by people, its created by people, andmost importantlyit impacts people.",
  "It is a powerful tool we are only just beginning to understand, and that is a profound responsibility.",
  "There are concerns among health care professionals that these systems might not be designed in the publics interest but as incomegenerating machines.",
  "This is especially true in the United States where there is a longstanding ethical dilemma of improving health care, but also increasing profits.",
  "For example, the algorithms could be designed to provide patients with unnecessary tests or medication in which the algorithms proprietary owners hold stakes.",
  "There is potential for machine learning in health care to provide professionals an additional tool to diagnose, medicate, and plan recovery paths for patients, but this requires these biases to be mitigated.",
  "Since the 2010s, advances in both machine learning algorithms and computer hardware have led to more efficient methods for training deep neural networks that contain many layers of nonlinear hidden units.",
  "By 2019, graphics processing units , often with AIspecific enhancements, had displaced CPUs as the dominant method of training largescale commercial cloud AI.",
  "OpenAI estimated the hardware compute used in the largest deep learning projects from AlexNet to AlphaZero , and found a 300,000fold increase in the amount of compute required, with a doublingtime trendline of 3.4 months.",
  "Tensor Processing Units are specialised hardware accelerators developed by Google specifically for machine learning workloads.",
  "Unlike generalpurpose GPUs and FPGAs, TPUs are optimised for tensor computations, making them particularly efficient for deep learning tasks such as training and inference.",
  "They are widely used in Google Cloud AI services and largescale machine learning models like Googles DeepMind AlphaFold and large language models.",
  "TPUs leverage matrix multiplication units and highbandwidth memory to accelerate computations while maintaining energy efficiency.",
  "Since their introduction in 2016, TPUs have become a key component of AI infrastructure, especially in cloudbased environments.",
  "Neuromorphic computing refers to a class of computing systems designed to emulate the structure and functionality of biological neural networks.",
  "These systems may be implemented through softwarebased simulations on conventional hardware or through specialised hardware architectures.",
  "Physical neural networks A physical neural network is a specific type of neuromorphic hardware that relies on electrically adjustable materials, such as memristors, to emulate the function of neural synapses.",
  "The term physical neural network highlights the use of physical hardware for computation, as opposed to softwarebased implementations.",
  "It broadly refers to artificial neural networks that use materials with adjustable resistance to replicate neural synapses.",
  "Embedded machine learning is a subfield of machine learning where models are deployed on embedded systems with limited computing resources, such as wearable computers, edge devices and microcontrollers.",
  "Running models directly on these devices eliminates the need to transfer and store data on cloud servers for further processing, thereby reducing the risk of data breaches, privacy leaks and theft of intellectual property, personal data and business secrets.",
  "Embedded machine learning can be achieved through various techniques, such as hardware acceleration, approximate computing, and model optimisation.",
  "Common optimisation techniques include pruning, quantisation, knowledge distillation, lowrank factorisation, network architecture search, and parameter sharing.",
  "Software suites containing a variety of machine learning algorithms include the following KNIME RapidMiner Journal of Machine Learning Research Machine Learning Nature Machine Intelligence Neural Computation IEEE Transactions on Pattern Analysis and Machine Intelligence AAAI Conference on Artificial Intelligence Association for Computational Linguistics European Conference on Machine Learning and Principles and Practice of Knowledge Discovery in Databases International Conference on Computational Intelligence Methods for Bioinformatics and Biostatistics International Conference on Machine Learning International Conference on Learning Representations International Conference on Intelligent Robots and Systems Conference on Knowledge Discovery and Data Mining Conference on Neural Information Processing Systems Automated machine learning Process of automating the application of machine learning Big data Extremely large or complex datasets Deep learning branch of ML concerned with artificial neural networks Differentiable programming Programming paradigm List of datasets for machinelearning research Mtheory Machine unlearning Solomonoffs theory of inductive inference Mathematical theory Domingos, Pedro .",
  "The Master Algorithm How the Quest for the Ultimate Learning Machine Will Remake Our World.",
  "Artificial Intelligence A New Synthesis.",
  "Archived from the original on 26 July 2020.",
  "Retrieved 18 November 2019.",
  "Poole, David Mackworth, Alan Goebel, Randy .",
  "Computational Intelligence A Logical Approach.",
  "New York Oxford University Press.",
  "Archived from the original on 26 July 2020.",
  "Retrieved 22 August 2020.",
  "Norvig, Peter , Artificial Intelligence A Modern Approach , Upper Saddle River, New Jersey Prentice Hall, ISBN 0137903952.",
  "International Machine Learning Society mloss is an academic database of opensource machine learning software."
]